--物品礼包-新手装备套
---===================================================
x892326_g_scriptId = 892326
x892326_g_GiftItem = 38001876
x892326_g_Item = {10555506,10555507,10555508,10555509,10555511,10555513,10555510,10555512,10555514,10555515,10555514,10555515,10555516,10555517,10555518,10555519,10155001,10141080,10156003,10156004}
--**********************************
--事件交互入口
--**********************************
function x892326_OnDefaultEvent( sceneId, selfId, bagIndex )
-- 不需要这个接口，但要保留空函数
end

--**********************************
--这个物品的使用过程是否类似于技能：
--系统会在执行开始时检测这个函数的返回值，如果返回失败则忽略后面的类似技能的执行。
--返回1：技能类似的物品，可以继续类似技能的执行；返回0：忽略后面的操作。
--**********************************
function x892326_IsSkillLikeScript( sceneId, selfId)
	return 1; --这个脚本需要动作支持
end

--**********************************
--直接取消效果：
--系统会直接调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：已经取消对应效果，不再执行后续操作；返回0：没有检测到相关效果，继续执行。
--**********************************
function x892326_CancelImpacts( sceneId, selfId )
	return 0; --不需要这个接口，但要保留空函数,并且始终返回0。
end

--**********************************
--条件检测入口：
--系统会在技能检测的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：条件检测通过，可以继续执行；返回0：条件检测失败，中断后续执行。
--**********************************
function x892326_OnConditionCheck( sceneId, selfId )
	--校验使用的物品
	if(1~=LuaFnVerifyUsedItem(sceneId, selfId)) then
		return 0
	end
	--等级检查
	if GetLevel(sceneId,selfId) < 15 then
		x892326_Tip(sceneId,selfId,"请在15级以后再来使用礼包");
		return 0 
	end
	if GetMenPai(sceneId,selfId) == 9 then
		x892326_Tip(sceneId,selfId,"请在加入门派以后再来使用礼包");
		return 0 
	end
	local itemTblIndex = LuaFnGetItemIndexOfUsedItem( sceneId, selfId );
	if x892326_g_GiftItem ~= itemTblIndex then
		x892326_Tip(sceneId,selfId,"物品非法");
		return 0 
	end
	--背包空间检测
	if LuaFnGetPropertyBagSpace(sceneId,selfId) < 1 then
		x892326_Tip(sceneId,selfId,"#{XSHLY_150522_166}");
		return 0 
	end
	return 1; --不需要任何条件，并且始终返回1。
end

--**********************************
--消耗检测及处理入口：
--系统会在技能消耗的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：消耗处理通过，可以继续执行；返回0：消耗检测失败，中断后续执行。
--注意：这不光负责消耗的检测也负责消耗的执行。
--**********************************
function x892326_OnDeplete( sceneId, selfId )
	if(0<LuaFnDepletingUsedItem(sceneId, selfId)) then
		return 1;
	end
	return 1;
end
--**********************************
--只会执行一次入口：
--聚气和瞬发技能会在消耗完成后调用这个接口（聚气结束并且各种条件都满足的时候），而引导
--技能也会在消耗完成后调用这个接口（技能的一开始，消耗成功执行之后）。
--返回1：处理成功；返回0：处理失败。
--注：这里是技能生效一次的入口
--**********************************
function x892326_OnActivateOnce( sceneId, selfId )
	--等级检查
	if GetLevel(sceneId,selfId) < 15 then
		x892326_Tip(sceneId,selfId,"请在15级以后再来使用礼包");
		return 0 
	end
	if GetMenPai(sceneId,selfId) == 9 then
		x892326_Tip(sceneId,selfId,"请在加入门派以后再来使用礼包");
		return 0 
	end
	--背包空间检测
	if LuaFnGetPropertyBagSpace(sceneId,selfId) < 18 then
		x892326_Tip(sceneId,selfId,"背包空间不足！");
		return 0 
	end
	local Itemid = LuaFnGetItemIndexOfUsedItem(sceneId,selfId);
	local nBagPos = LuaFnGetBagIndexOfUsedItem(sceneId,selfId);
	local nMenPai = GetMenPai(sceneId,selfId);
	local nSuperWeaponId = 0;
	
	for i = 1,20 do
		local pos = TryRecieveItem( sceneId, selfId, x892326_g_Item[i], 1)
		if LuaFnGetItemBindStatus(sceneId,selfId,pos) ~= 1 then
			LuaFnItemBind(sceneId,selfId,pos)
		end
	end

	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 151, 0)
	--x892326_Tip(sceneId,selfId,format("恭喜你成功打开了%s！获得%s一把",GetItemName(sceneId,x892326_g_GiftItem),GetItemName(sceneId,nSuperWeaponId)))
	x892326_Xinshouxiangqian( sceneId, selfId )
	return 1
end

function x892326_Xinshouxiangqian( sceneId, selfId )
	
	local bing = {
	[10555506] = {50413004,50412006,50414001},		[10555507] = {50413004,50412006,50414001},--防具
	[10555508] = {50413004,50412006,50414001},		[10555509] = {50413004,50412006,50414001},
	[10555511] = {50413004,50412006,50414001},		[10555513] = {50413004,50412006,50414001},
	[10555510] = {50402006,50403001,50404002},		[10555512] = {50402006,50403001,50404002},--武具
	[10555514] = {50402006,50403001,50404002},		[10555515] = {50402006,50403001,50404002},
	[10555516] = {50402006,50403001,50404002},		[10555517] = {50402006,50403001,50404002},
	[10555518] = {50402006,50403001,50404002},		[10555519] = {50402006,50403001,50404002},
	[10155001] = {50402006,50403001,50413004},		[10141080] = {50402006,50403001,50413004},--暗器、坐骑、武魂
	[10156003] = {50402006,50403001,50413004},		[10156004] = {50402006,50403001,50413004},
	}	--冰
	
	local huo  = {
	[10555506] = {50413004,50412007,50414001},		[10555507] = {50413004,50412007,50414001},--防具
	[10555508] = {50413004,50412007,50414001},		[10555509] = {50413004,50412007,50414001},
	[10555511] = {50413004,50412007,50414001},		[10555513] = {50413004,50412007,50414001},
	[10555510] = {50402007,50403001,50404002},		[10555512] = {50402007,50403001,50404002},--武具
	[10555514] = {50402007,50403001,50404002},		[10555515] = {50402007,50403001,50404002},
	[10555516] = {50402007,50403001,50404002},		[10555517] = {50402007,50403001,50404002},
	[10555518] = {50402007,50403001,50404002},		[10555519] = {50402007,50403001,50404002},
	[10155001] = {50402007,50403001,50413004},		[10141080] = {50402007,50403001,50413004},--暗器、坐骑、武魂
	[10156003] = {50402007,50403001,50413004},		[10156004] = {50402007,50403001,50413004},
	}	--火
	
	local xuan = {
	[10555506] = {50413004,50412005,50414001},		[10555507] = {50413004,50412005,50414001},--防具
	[10555508] = {50413004,50412005,50414001},		[10555509] = {50413004,50412005,50414001},
	[10555511] = {50413004,50412005,50414001},		[10555513] = {50413004,50412005,50414001},
	[10555510] = {50402005,50403001,50404002},		[10555512] = {50402005,50403001,50404002},--武具
	[10555514] = {50402005,50403001,50404002},		[10555515] = {50402005,50403001,50404002},
	[10555516] = {50402005,50403001,50404002},		[10555517] = {50402005,50403001,50404002},
	[10555518] = {50402005,50403001,50404002},		[10555519] = {50402005,50403001,50404002},
	[10155001] = {50402005,50403001,50413004},		[10141080] = {50402005,50403001,50413004},--暗器、坐骑、武魂
	[10156003] = {50402005,50403001,50413004},		[10156004] = {50402005,50403001,50413004},
	}	--玄
	
	local du   = {
	[10555506] = {50413004,50412008,50414001},		[10555507] = {50413004,50412008,50414001},--防具
	[10555508] = {50413004,50412008,50414001},		[10555509] = {50413004,50412008,50414001},
	[10555511] = {50413004,50412008,50414001},		[10555513] = {50413004,50412008,50414001},
	[10555510] = {50402008,50403001,50404002},		[10555512] = {50402008,50403001,50404002},--武具
	[10555514] = {50402008,50403001,50404002},		[10555515] = {50402008,50403001,50404002},
	[10555516] = {50402008,50403001,50404002},		[10555517] = {50402008,50403001,50404002},
	[10555518] = {50402008,50403001,50404002},		[10555519] = {50402008,50403001,50404002},
	[10155001] = {50402008,50403001,50413004},		[10141080] = {50402008,50403001,50413004},--暗器、坐骑、武魂
	[10156003] = {50402008,50403001,50413004},		[10156004] = {50402008,50403001,50413004},
	}	--毒

	---新手装宝石镶嵌。
	local MenPai = GetMenPai(sceneId,selfId)
	local Table
	if MenPai == 3 or MenPai == 7 then--冰
		Table = bing
	end
	if MenPai == 1 or MenPai == 8 then--火
		Table = huo
	end
	if MenPai == 0 or MenPai == 4 or MenPai == 6 then--玄
		Table = xuan
	end
	if MenPai == 2 or MenPai == 5 then--毒
		Table = du
	end
    for i = 0,29 do
		local item = LuaFnGetItemTableIndexByIndex(sceneId,selfId,i)	
		if item == 10555506 or item == 10555507 or item == 10555508 or item == 10555509 or item == 10555510 or item == 10555511 or item == 10555512 or item == 10555513 or item == 10555514 or item == 10555515 or item == 10555516 or item == 10555517 or item == 10555518 or item == 10555519 or item == 10155001 or item == 10141080 or item == 10156003 or item == 10156004 then
	        local nowBore_Count =  GetBagGemCount( sceneId, selfId, i )
	        while nowBore_Count ~= 3 do
		    AddBagItemSlot( sceneId, selfId, i )				  
		    nowBore_Count =  GetBagGemCount( sceneId, selfId, i )				  
	        end				  
		end
	end
	for i = 0,29 do
		local item = LuaFnGetItemTableIndexByIndex(sceneId,selfId,i)
		if item == 10555506 or item == 10555507 or item == 10555508 or item == 10555509 or item == 10555510 or item == 10555511 or item == 10555512 or item == 10555513 or item == 10555514 or item == 10555515 or item == 10555516 or item == 10555517 or item == 10555518 or item == 10555519 or item == 10155001 or item == 10141080 or item == 10156003 or item == 10156004 then
			for k = 1,3 do
			    local PosGem = TryRecieveItem(sceneId,selfId,Table[item][k],1)
			    GemEnchasing( sceneId, selfId, PosGem, i )
			end
		end
	end
end
--**********************************
--引导心跳处理入口：
--引导技能会在每次心跳结束时调用这个接口。
--返回：1继续下次心跳；0：中断引导。
--注：这里是技能生效一次的入口
--**********************************
function x892326_OnActivateEachTick( sceneId, selfId)
	return 1; --不是引导性脚本, 只保留空函数.
end

function x892326_Tip( sceneId,selfId,Tip )
	BeginEvent( sceneId )
	AddText( sceneId, Tip )
	EndEvent( sceneId )
	DispatchMissionTips( sceneId, selfId )
end