--注意：
--物品技能的逻辑只能使用基础技能和脚本来实现
--脚本:
--以下是脚本样例:
------------------------------------------------------------------------------------------
--一般物品的默认脚本

--脚本号
x300103_g_scriptId = 300103 --临时写这个,真正用的时候一定要改.

--需要的等级
x300103_g_levelRequire = 1
--AE范围半径
x300103_g_radiusAE = 3.0
--AE的目标关系标记
x300103_g_standFlag = 1 -- 2:队友， 1：友军， -1：敌军
--AE影响数目限制
x300103_g_effectCount = 4 -- -1:不限制
--效果的ID
x300103_g_Impact1 = {
	[30509092] = 351,
	[30509093] = 352,
	[30509094] = 353,
	[30509095] = 354,
	[30509096] = 355,
	[30509097] = 350,
	[30509098] = 345,
	[30509099] = 346,
	[30509100] = 176,
	[30509101] = 347,
	[30509102] = 348,
	[30509103] = 343,
	[30509104] = 344,
	[30509105] = 342,
	[30509106] = 186,
	[30509107] = 340,
	[30509108] = 341,
	[30509109] = 752,
	[30509110] = 753,
	[30509111] = 751,
	[30509112] = 749,
	[30509113] = 750,
	[30509115] = 728,
	[30509116] = 729,
	[30509121] = 372,
	[30509122] = 733,
	[30509127] = 734,
	[30509128] = 735,
	[30509129] = 736,
	[30509130] = 737,
	[30509142] = -1,
	[30509143] = -1,
	[30509144] = -1,
	[30509145] = 84,
	[30509146] = 341,
	[30509153] = -1,
	[30509154] = 159,
	[30509155] = 160,
	[30509156] = 741,
	[30509157] = 67,
	[30509161] = 61,
	[30509162] = 40,
	[30509163] = 41,
	[30509164] = 81,
	[30509165] = 82,
	[30509166] = 356,
	[30509167] = 357,
	[30509168] = 358,
	[30509169] = 359,
	[30509170] = 360,
	[30509171] = 361,
	[30509172] = 362,
	[30509173] = 363,
	[30509174] = 364,
	[30509175] = 339,
	[30509176] = 304,
	[30509177] = 305,
} --临时写这个
x300103_g_Impact2 = -1 --不用

--**********************************
--事件交互入口
--**********************************
function x300103_OnDefaultEvent( sceneId, selfId, bagIndex )
-- 不需要这个接口，但要保留空函数
end

--**********************************
--这个物品的使用过程是否类似于技能：
--系统会在执行开始时检测这个函数的返回值，如果返回失败则忽略后面的类似技能的执行。
--返回1：技能类似的物品，可以继续类似技能的执行；返回0：忽略后面的操作。
--**********************************
function x300103_IsSkillLikeScript( sceneId, selfId)
	return 1; --这个脚本需要动作支持
end

--**********************************
--直接取消效果：
--系统会直接调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：已经取消对应效果，不再执行后续操作；返回0：没有检测到相关效果，继续执行。
--**********************************
function x300103_CancelImpacts( sceneId, selfId )
	return 0; --不需要这个接口，但要保留空函数,并且始终返回0。
end

--**********************************
--条件检测入口：
--系统会在技能检测的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：条件检测通过，可以继续执行；返回0：条件检测失败，中断后续执行。
--**********************************
function x300103_OnConditionCheck( sceneId, selfId )
	--校验使用的物品
	if(1~=LuaFnVerifyUsedItem(sceneId, selfId)) then
		return 0
	end	
	return 1; --不需要任何条件，并且始终返回1。
end

--**********************************
--消耗检测及处理入口：
--系统会在技能消耗的时间点调用这个接口，并根据这个函数的返回值确定以后的流程是否执行。
--返回1：消耗处理通过，可以继续执行；返回0：消耗检测失败，中断后续执行。
--注意：这不光负责消耗的检测也负责消耗的执行。
--**********************************
function x300103_OnDeplete( sceneId, selfId )
--	if(LuaFnDepletingUsedItem(sceneId, selfId) > 0) then
--		return 1;
--	end
	return 1;
end

--**********************************
--只会执行一次入口：
--聚气和瞬发技能会在消耗完成后调用这个接口（聚气结束并且各种条件都满足的时候），而引导
--技能也会在消耗完成后调用这个接口（技能的一开始，消耗成功执行之后）。
--返回1：处理成功；返回0：处理失败。
--注：这里是技能生效一次的入口
--**********************************
function x300103_OnActivateOnce( sceneId, selfId )
	local itemTblIndex = LuaFnGetItemIndexOfUsedItem( sceneId, selfId );
	
	if(x300103_g_Impact1[itemTblIndex] ~= -1 and x300103_g_Impact1[itemTblIndex] ~= nil ) then
		--给目标加效果
		local posX,posZ = GetWorldPos(sceneId, selfId)
		LuaFnDelAvailableItem(sceneId,selfId,itemTblIndex,1)
		CreateSpecialObjByDataIndex(sceneId, selfId, x300103_g_Impact1[itemTblIndex], posX, posZ, 0)
	else
		BeginEvent( sceneId )
			AddText( sceneId, "非法数据：该物品尚未开放！" )
		EndEvent( sceneId )
		DispatchMissionTips( sceneId, selfId )
		return 0;
	end
	return 1;
end

--**********************************
--引导心跳处理入口：
--引导技能会在每次心跳结束时调用这个接口。
--返回：1继续下次心跳；0：中断引导。
--注：这里是技能生效一次的入口
--**********************************
function x300103_OnActivateEachTick( sceneId, selfId)
	return 1; --不是引导性脚本, 只保留空函数.
end
