--武魂系统
--modify 2019-7-14 20:54:46 重写部分代码
--Q546528533兼容代码，去除引擎限制以及bug修复
--脚本号
x900004_g_scriptId = 900004
x900004_RunHunShiCompound_Data = 
{   -- 快捷
	[1] = 
	{
		[1] = { newlevel = 2, needcount = 3, needmoney = 5000, },
		[2] = { newlevel = 3, needcount = 9, needmoney = 20000, },
		[3] = { newlevel = 4, needcount = 27, needmoney = 70000, },
		[4] = { newlevel = 5, needcount = 81, needmoney = 220000, },
		[5] = { newlevel = 6, needcount = 162, needmoney = 455000, },
		[6] = { newlevel = 7, needcount = 324, needmoney = 925000, },
		[7] = { newlevel = 8, needcount = 648, needmoney = 1250000, },
	},
	-- 普通
	[2] = 
	{
		[1] = { newlevel = 2, needcount = 3, needmoney = 5000, },
		[2] = { newlevel = 3, needcount = 3, needmoney = 10000, },
		[3] = { newlevel = 4, needcount = 3, needmoney = 10000, },
		[4] = { newlevel = 5, needcount = 3, needmoney = 15000, },
		[5] = { newlevel = 6, needcount = 2, needmoney = 15000, },
		[6] = { newlevel = 7, needcount = 2, needmoney = 20000, },
		[7] = { newlevel = 8, needcount = 2, needmoney = 40000, },
	},
}
x900004_RunHunShiCompound_Item = 
{
	[1]=
	{
		20310122,	--润魂石·御（1级）
		20310123,	--润魂石·御（2级）
		20310124,	--润魂石·御（3级）
		20310125,	--润魂石·御（4级）
		20310126,	--润魂石·御（5级）
		20310127,	--润魂石·御（6级）
		20310128,	--润魂石·御（7级）
		20310129,	--润魂石·御（8级）
		20310130,	--润魂石·御（9级）
	},
	[2]=
	{
		20310131,	--润魂石·击（1级）
		20310132,	--润魂石·击（2级）
		20310133,	--润魂石·击（3级）
		20310134,	--润魂石·击（4级）
		20310135,	--润魂石·击（5级）
		20310136,	--润魂石·击（6级）
		20310137,	--润魂石·击（7级）
		20310138,	--润魂石·击（8级）
		20310139,	--润魂石·击（9级）
	},
	[3]=
	{
		20310140,	--润魂石·破（1级）
		20310141,	--润魂石·破（2级）
		20310142,	--润魂石·破（3级）
		20310143,	--润魂石·破（4级）
		20310144,	--润魂石·破（5级）
		20310145,	--润魂石·破（6级）
		20310146,	--润魂石·破（7级）
		20310147,	--润魂石·破（8级）
		20310148,	--润魂石·破（9级）
	},
	[4]=
	{
		20310149,	--润魂石·暴（1级）
		20310150,	--润魂石·暴（2级）
		20310151,	--润魂石·暴（3级）
		20310152,	--润魂石·暴（4级）
		20310153,	--润魂石·暴（5级）
		20310154,	--润魂石·暴（6级）
		20310155,	--润魂石·暴（7级）
		20310156,	--润魂石·暴（8级）
		20310157,	--润魂石·暴（9级）
	},
}
x900004_Kfs_AttrType = {
	[10156001] = 0,
	[10156002] = 1,
	[10156003] = 0,
	[10156004] = 1,
}

x900004_KfsDataVale = "&W(%w%w%w)(%w)(%w%w%w)(%w%w%w%w%w)(%w)(%w)(%w%w%w%w%w%w%w%w%w%w%w%w%w%w)(%w%w%w%w%w%w)"
x900004_nExpTable = {1500,1510,1540,1580,1640,1710,1800,1890,2000,2120,2250,2390,2540,2700,2870,3060,3250,3450,3660,3880,4120,4360,4610,4870,5130,5410,5700,5990,6300,6610,6930,7260,7600,7950,8310,8670,9040,9430,9820,10210,10620,11040,11460,11890,12330,12780,13230,13690,14170,14640,15130,15630,16130,16640,17160,17680,18220,18760,19310,19860,20430,21000,21580,22170,22760,23360,23970,24590,25210,25840,26480,27130,27780,28440,29110,29790,30470,31160,31860,32560,33270,33990,34720,35450,36190,36940,37690,38450,39220,40000,40780,41570,42360,43170,43980,44790,45620,46450,47280,48130,48980,49840,50700,51580,52450,53340,54230,55130,56040,56950,57870,58790,59730,60660,61610,62560,63520,64490,65460,66440,}
x900004_m_Money_COMPOUND = {10000,10000,15000,15000,20000,20000,25000,25000,30000,}
x900004_Kfs_Magic = {"#{WH_090729_62}","#{WH_090729_63}","#{WH_090729_64}","#{WH_090729_65}"}
x900004_INDEX_SLOT_ITEM1 = 20310158 --麟木剑
x900004_INDEX_SLOT_ITEM2 = 20310159 --破天剑
x900004_KfsAttrExBook = {
	[30700214] = "B",
	[30700215] = "D",
	[30700216] = "F",
	[30700217] = "H",
	[30700218] = "A",
	[30700219] = "C",
	[30700220] = "E",
	[30700221] = "G",
	[30700222] = "I",
	[30700223] = "J",
	[30700224] = "K",
	[30700225] = "L",
	[30700226] = "M",
	[30700227] = "N",
	[30700228] = "O",
	[30700229] = "P",

}
x900004_nAttrExTable = {
	["A1"] = {"冰攻击(1级)",20310131,5000,30},
	["A2"] = {"冰攻击(2级)",20310132,5000,41},
	["A3"] = {"冰攻击(3级)",20310133,10000,63},
	["A4"] = {"冰攻击(4级)",20310134,10000,93},
	["A5"] = {"冰攻击(5级)",20310135,15000,131},
	["A6"] = {"冰攻击(6级)",20310136,15000,174},
	["A7"] = {"冰攻击(7级)",20310137,20000,223},
	["A8"] = {"冰攻击(8级)",20310138,20000,277},
	["A9"] = {"冰攻击(9级)",20310139,25000,336},
	["A0"] = {"冰攻击(10级)",-1,0,400},
	["B1"] = {"冰抗性(1级)",20310122,5000,8},
	["B2"] = {"冰抗性(2级)",20310123,5000,11},
	["B3"] = {"冰抗性(3级)",20310124,10000,16},
	["B4"] = {"冰抗性(4级)",20310125,10000,24},
	["B5"] = {"冰抗性(5级)",20310126,15000,33},
	["B6"] = {"冰抗性(6级)",20310127,15000,44},
	["B7"] = {"冰抗性(7级)",20310128,20000,56},
	["B8"] = {"冰抗性(8级)",20310129,20000,70},
	["B9"] = {"冰抗性(9级)",20310130,25000,84},
	["B0"] = {"冰抗性(10级)",-1,0,100},
	["C1"] = {"火攻击(1级)",20310131,5000,30},
	["C2"] = {"火攻击(2级)",20310132,5000,41},
	["C3"] = {"火攻击(3级)",20310133,10000,63},
	["C4"] = {"火攻击(4级)",20310134,10000,93},
	["C5"] = {"火攻击(5级)",20310135,15000,131},
	["C6"] = {"火攻击(6级)",20310136,15000,174},
	["C7"] = {"火攻击(7级)",20310137,20000,223},
	["C8"] = {"火攻击(8级)",20310138,20000,277},
	["C9"] = {"火攻击(9级)",20310139,25000,336},
	["C0"] = {"火攻击(10级)",-1,0,400},
	["D1"] = {"火抗性(1级)",20310122,5000,8},
	["D2"] = {"火抗性(2级)",20310123,5000,11},
	["D3"] = {"火抗性(3级)",20310124,10000,16},
	["D4"] = {"火抗性(4级)",20310125,10000,24},
	["D5"] = {"火抗性(5级)",20310126,15000,33},
	["D6"] = {"火抗性(6级)",20310127,15000,44},
	["D7"] = {"火抗性(7级)",20310128,20000,56},
	["D8"] = {"火抗性(8级)",20310129,20000,70},
	["D9"] = {"火抗性(9级)",20310130,25000,84},
	["D0"] = {"火抗性(10级)",-1,0,100},
	["E1"] = {"玄攻击(1级)",20310131,5000,30},
	["E2"] = {"玄攻击(2级)",20310132,5000,41},
	["E3"] = {"玄攻击(3级)",20310133,10000,63},
	["E4"] = {"玄攻击(4级)",20310134,10000,93},
	["E5"] = {"玄攻击(5级)",20310135,15000,131},
	["E6"] = {"玄攻击(6级)",20310136,15000,174},
	["E7"] = {"玄攻击(7级)",20310137,20000,223},
	["E8"] = {"玄攻击(8级)",20310138,20000,277},
	["E9"] = {"玄攻击(9级)",20310139,25000,336},
	["E0"] = {"玄攻击(10级)",-1,0,400},
	["F1"] = {"玄抗性(1级)",20310122,5000,8},
	["F2"] = {"玄抗性(2级)",20310123,5000,11},
	["F3"] = {"玄抗性(3级)",20310124,10000,16},
	["F4"] = {"玄抗性(4级)",20310125,10000,24},
	["F5"] = {"玄抗性(5级)",20310126,15000,33},
	["F6"] = {"玄抗性(6级)",20310127,15000,44},
	["F7"] = {"玄抗性(7级)",20310128,20000,56},
	["F8"] = {"玄抗性(8级)",20310129,20000,70},
	["F9"] = {"玄抗性(9级)",20310130,25000,84},
	["F0"] = {"玄抗性(10级)",-1,0,100},
	["G1"] = {"毒攻击(1级)",20310131,5000,30},
	["G2"] = {"毒攻击(2级)",20310132,5000,41},
	["G3"] = {"毒攻击(3级)",20310133,10000,63},
	["G4"] = {"毒攻击(4级)",20310134,10000,93},
	["G5"] = {"毒攻击(5级)",20310135,15000,131},
	["G6"] = {"毒攻击(6级)",20310136,15000,174},
	["G7"] = {"毒攻击(7级)",20310137,20000,223},
	["G8"] = {"毒攻击(8级)",20310138,20000,277},
	["G9"] = {"毒攻击(9级)",20310139,25000,336},
	["G0"] = {"毒攻击(10级)",-1,0,400},
	["H1"] = {"毒抗性(1级)",20310122,5000,8},
	["H2"] = {"毒抗性(2级)",20310123,5000,11},
	["H3"] = {"毒抗性(3级)",20310124,10000,16},
	["H4"] = {"毒抗性(4级)",20310125,10000,24},
	["H5"] = {"毒抗性(5级)",20310126,15000,33},
	["H6"] = {"毒抗性(6级)",20310127,15000,44},
	["H7"] = {"毒抗性(7级)",20310128,20000,56},
	["H8"] = {"毒抗性(8级)",20310129,20000,70},
	["H9"] = {"毒抗性(9级)",20310130,25000,84},
	["H0"] = {"毒抗性(10级)",-1,0,100},
	["I1"] = {"忽略目标冰抗(1级)",20310140,5000,8},
	["I2"] = {"忽略目标冰抗(2级)",20310141,5000,11},
	["I3"] = {"忽略目标冰抗(3级)",20310142,10000,16},
	["I4"] = {"忽略目标冰抗(4级)",20310143,10000,24},
	["I5"] = {"忽略目标冰抗(5级)",20310144,15000,33},
	["I6"] = {"忽略目标冰抗(6级)",20310145,15000,44},
	["I7"] = {"忽略目标冰抗(7级)",20310146,20000,56},
	["I8"] = {"忽略目标冰抗(8级)",20310147,20000,70},
	["I9"] = {"忽略目标冰抗(9级)",20310148,25000,84},
	["I0"] = {"忽略目标冰抗(10级)",-1,0,100},
	["J1"] = {"忽略目标火抗(1级)",20310140,5000,8},
	["J2"] = {"忽略目标火抗(2级)",20310141,5000,11},
	["J3"] = {"忽略目标火抗(3级)",20310142,10000,16},
	["J4"] = {"忽略目标火抗(4级)",20310143,10000,24},
	["J5"] = {"忽略目标火抗(5级)",20310144,15000,33},
	["J6"] = {"忽略目标火抗(6级)",20310145,15000,44},
	["J7"] = {"忽略目标火抗(7级)",20310146,20000,56},
	["J8"] = {"忽略目标火抗(8级)",20310147,20000,70},
	["J9"] = {"忽略目标火抗(9级)",20310148,25000,84},
	["J0"] = {"忽略目标火抗(10级)",-1,0,100},
	["K1"] = {"忽略目标玄抗(1级)",20310140,5000,8},
	["K2"] = {"忽略目标玄抗(2级)",20310141,5000,11},
	["K3"] = {"忽略目标玄抗(3级)",20310142,10000,16},
	["K4"] = {"忽略目标玄抗(4级)",20310143,10000,24},
	["K5"] = {"忽略目标玄抗(5级)",20310144,15000,33},
	["K6"] = {"忽略目标玄抗(6级)",20310145,15000,44},
	["K7"] = {"忽略目标玄抗(7级)",20310146,20000,56},
	["K8"] = {"忽略目标玄抗(8级)",20310147,20000,70},
	["K9"] = {"忽略目标玄抗(9级)",20310148,25000,84},
	["K0"] = {"忽略目标玄抗(10级)",-1,0,100},
	["L1"] = {"忽略目标毒抗(1级)",20310140,5000,8},
	["L2"] = {"忽略目标毒抗(2级)",20310141,5000,11},
	["L3"] = {"忽略目标毒抗(3级)",20310142,10000,16},
	["L4"] = {"忽略目标毒抗(4级)",20310143,10000,24},
	["L5"] = {"忽略目标毒抗(5级)",20310144,15000,33},
	["L6"] = {"忽略目标毒抗(6级)",20310145,15000,44},
	["L7"] = {"忽略目标毒抗(7级)",20310146,20000,56},
	["L8"] = {"忽略目标毒抗(8级)",20310147,20000,70},
	["L9"] = {"忽略目标毒抗(9级)",20310148,25000,84},
	["L0"] = {"忽略目标毒抗(10级)",-1,0,100},
	["M1"] = {"降低目标冰抗下限(1级)",20310149,5000,2},
	["M2"] = {"降低目标冰抗下限(2级)",20310150,5000,3},
	["M3"] = {"降低目标冰抗下限(3级)",20310151,10000,4},
	["M4"] = {"降低目标冰抗下限(4级)",20310152,10000,5},
	["M5"] = {"降低目标冰抗下限(5级)",20310153,15000,7},
	["M6"] = {"降低目标冰抗下限(6级)",20310154,15000,9},
	["M7"] = {"降低目标冰抗下限(7级)",20310155,20000,12},
	["M8"] = {"降低目标冰抗下限(8级)",20310156,20000,14},
	["M9"] = {"降低目标冰抗下限(9级)",20310157,25000,17},
	["M0"] = {"降低目标冰抗下限(10级)",-1,0,20},
	["N1"] = {"降低目标火抗下限(1级)",20310149,5000,2},
	["N2"] = {"降低目标火抗下限(2级)",20310150,5000,3},
	["N3"] = {"降低目标火抗下限(3级)",20310151,10000,4},
	["N4"] = {"降低目标火抗下限(4级)",20310152,10000,5},
	["N5"] = {"降低目标火抗下限(5级)",20310153,15000,7},
	["N6"] = {"降低目标火抗下限(6级)",20310154,15000,9},
	["N7"] = {"降低目标火抗下限(7级)",20310155,20000,12},
	["N8"] = {"降低目标火抗下限(8级)",20310156,20000,14},
	["N9"] = {"降低目标火抗下限(9级)",20310157,25000,17},
	["N0"] = {"降低目标火抗下限(10级)",-1,0,20},
	["O1"] = {"降低目标玄抗下限(1级)",20310149,5000,2},
	["O2"] = {"降低目标玄抗下限(2级)",20310150,5000,3},
	["O3"] = {"降低目标玄抗下限(3级)",20310151,10000,4},
	["O4"] = {"降低目标玄抗下限(4级)",20310152,10000,5},
	["O5"] = {"降低目标玄抗下限(5级)",20310153,15000,7},
	["O6"] = {"降低目标玄抗下限(6级)",20310154,15000,9},
	["O7"] = {"降低目标玄抗下限(7级)",20310155,20000,12},
	["O8"] = {"降低目标玄抗下限(8级)",20310156,20000,14},
	["O9"] = {"降低目标玄抗下限(9级)",20310157,25000,17},
	["O0"] = {"降低目标玄抗下限(10级)",-1,0,20},
	["P1"] = {"降低目标毒抗下限(1级)",20310149,5000,2},
	["P2"] = {"降低目标毒抗下限(2级)",20310150,5000,3},
	["P3"] = {"降低目标毒抗下限(3级)",20310151,10000,4},
	["P4"] = {"降低目标毒抗下限(4级)",20310152,10000,5},
	["P5"] = {"降低目标毒抗下限(5级)",20310153,15000,7},
	["P6"] = {"降低目标毒抗下限(6级)",20310154,15000,9},
	["P7"] = {"降低目标毒抗下限(7级)",20310155,20000,12},
	["P8"] = {"降低目标毒抗下限(8级)",20310156,20000,14},
	["P9"] = {"降低目标毒抗下限(9级)",20310157,25000,17},
	["P0"] = {"降低目标毒抗下限(10级)",-1,0,20},
}
x900004_KfsItem_YanShouDan = 30700233 --武魂延寿丹
x900004_KfsItem_YiXiangDan = {30700243,30700244,30700245} --武魂易相丹
x900004_KfsItem_HuiTianShenShi = {30700240,30700241,30700242} --回天神石
x900004_Kfs_SkillTable = {["A1"]=1500,["A2"]=1501,["A3"]=1502,["A4"]=1503,["A5"]=1504,["A6"]=1505,["B1"]=1506,["B2"]=1507,["B3"]=1508,["B4"]=1509,["B5"]=1510,["B6"]=1511,["C1"]=1512,["C2"]=1513,["C3"]=1514,["C4"]=1515,["C5"]=1516,["C6"]=1517,["D1"]=1518,["D2"]=1519,["D3"]=1520,["D4"]=1521,["D5"]=1522,["D6"]=1523,["E1"]=1524,["E2"]=1525,["E3"]=1526,["E4"]=1527,["E5"]=1528,["E6"]=1529,["F1"]=1644,["F2"]=1645,["F3"]=1646,["F4"]=1647,["F5"]=1648,["F6"]=1649,["G1"]=1566,["G2"]=1567,["G3"]=1568,["G4"]=1569,["G5"]=1570,["G6"]=1571,["H1"]=1572,["H2"]=1573,["H3"]=1574,["H4"]=1575,["H5"]=1576,["H6"]=1577,["I1"]=1578,["I2"]=1579,["I3"]=1580,["I4"]=1581,["I5"]=1582,["I6"]=1583,["J1"]=1584,["J2"]=1585,["J3"]=1586,["J4"]=1587,["J5"]=1588,["J6"]=1589,["K1"]=1590,["K2"]=1591,["K3"]=1592,["K4"]=1593,["K5"]=1594,["K6"]=1595,["L1"]=1650,["L2"]=1651,["L3"]=1652,["L4"]=1653,["L5"]=1654,["L6"]=1655,["M1"]=1530,["M2"]=1531,["M3"]=1532,["M4"]=1533,["M5"]=1534,["M6"]=1535,["N1"]=1536,["N2"]=1537,["N3"]=1538,["N4"]=1539,["N5"]=1540,["N6"]=1541,["O1"]=1542,["O2"]=1543,["O3"]=1544,["O4"]=1545,["O5"]=1546,["O6"]=1547,["P1"]=1548,["P2"]=1549,["P3"]=1550,["P4"]=1551,["P5"]=1552,["P6"]=1553,["Q1"]=1554,["Q2"]=1555,["Q3"]=1556,["Q4"]=1557,["Q5"]=1558,["Q6"]=1559,["R1"]=1560,["R2"]=1561,["R3"]=1562,["R4"]=1563,["R5"]=1564,["R6"]=1565,["S1"]=1596,["S2"]=1597,["S3"]=1598,["S4"]=1599,["S5"]=1600,["S6"]=1601,["T1"]=1602,["T2"]=1603,["T3"]=1604,["T4"]=1605,["T5"]=1606,["T6"]=1607,["U1"]=1608,["U2"]=1609,["U3"]=1610,["U4"]=1611,["U5"]=1612,["U6"]=1613,["V1"]=1614,["V2"]=1615,["V3"]=1616,["V4"]=1617,["V5"]=1618,["V6"]=1619,["W1"]=1620,["W2"]=1621,["W3"]=1622,["W4"]=1623,["W5"]=1624,["W6"]=1625,["X1"]=1626,["X2"]=1627,["X3"]=1628,["X4"]=1629,["X5"]=1630,["X6"]=1631,["Y1"]=1632,["Y2"]=1633,["Y3"]=1634,["Y4"]=1635,["Y5"]=1636,["Y6"]=1637,["Z1"]=1638,["Z2"]=1639,["Z3"]=1640,["Z4"]=1641,["Z5"]=1642,["Z6"]=1643,["a1"]=1698,["a2"]=1699,["a3"]=1700,["a4"]=1701,["a5"]=1702,["a6"]=1703,["b1"]=1704,["b2"]=1705,["b3"]=1706,["b4"]=1707,["b5"]=1708,["b6"]=1709,["c1"]=1710,["c2"]=1711,["c3"]=1712,["c4"]=1713,["c5"]=1714,["c6"]=1715,["d1"]=1716,["d2"]=1717,["d3"]=1718,["d4"]=1719,["d5"]=1720,["d6"]=1721,["e1"]=1722,["e2"]=1723,["e3"]=1724,["e4"]=1725,["e5"]=1726,["e6"]=1727,["f1"]=1728,["f2"]=1729,["f3"]=1730,["f4"]=1731,["f5"]=1732,["f6"]=1733,["g1"]=1734,["g2"]=1735,["g3"]=1736,["g4"]=1737,["g5"]=1738,["g6"]=1739,["h1"]=1656,["h2"]=1657,["h3"]=1658,["h4"]=1659,["h5"]=1660,["h6"]=1661,["i1"]=1662,["i2"]=1663,["i3"]=1664,["i4"]=1665,["i5"]=1666,["i6"]=1667,["j1"]=1668,["j2"]=1669,["j3"]=1670,["j4"]=1671,["j5"]=1672,["j6"]=1673,["k1"]=1674,["k2"]=1675,["k3"]=1676,["k4"]=1677,["k5"]=1678,["k6"]=1679,["l1"]=1680,["l2"]=1681,["l3"]=1682,["l4"]=1683,["l5"]=1684,["l6"]=1685,["m1"]=1686,["m2"]=1687,["m3"]=1688,["m4"]=1689,["m5"]=1690,["m6"]=1691,["n1"]=1692,["n2"]=1693,["n3"]=1694,["n4"]=1695,["n5"]=1696,["n6"]=1697,["o1"]=1740,["o2"]=1741,["o3"]=1742,["o4"]=1743,["o5"]=1744,["o6"]=1745,["p1"]=1746,["p2"]=1747,["p3"]=1748,["p4"]=1749,["p5"]=1750,["p6"]=1751,}
x900004_Kfs_SkillTableEx = {[1500] = "A1",[1501] = "A2",[1502] = "A3",[1503] = "A4",[1504] = "A5",[1505] = "A6",[1506] = "B1",[1507] = "B2",[1508] = "B3",[1509] = "B4",[1510] = "B5",[1511] = "B6",[1512] = "C1",[1513] = "C2",[1514] = "C3",[1515] = "C4",[1516] = "C5",[1517] = "C6",[1518] = "D1",[1519] = "D2",[1520] = "D3",[1521] = "D4",[1522] = "D5",[1523] = "D6",[1524] = "E1",[1525] = "E2",[1526] = "E3",[1527] = "E4",[1528] = "E5",[1529] = "E6",[1644] = "F1",[1645] = "F2",[1646] = "F3",[1647] = "F4",[1648] = "F5",[1649] = "F6",[1566] = "G1",[1567] = "G2",[1568] = "G3",[1569] = "G4",[1570] = "G5",[1571] = "G6",[1572] = "H1",[1573] = "H2",[1574] = "H3",[1575] = "H4",[1576] = "H5",[1577] = "H6",[1578] = "I1",[1579] = "I2",[1580] = "I3",[1581] = "I4",[1582] = "I5",[1583] = "I6",[1584] = "J1",[1585] = "J2",[1586] = "J3",[1587] = "J4",[1588] = "J5",[1589] = "J6",[1590] = "K1",[1591] = "K2",[1592] = "K3",[1593] = "K4",[1594] = "K5",[1595] = "K6",[1650] = "L1",[1651] = "L2",[1652] = "L3",[1653] = "L4",[1654] = "L5",[1655] = "L6",[1530] = "M1",[1531] = "M2",[1532] = "M3",[1533] = "M4",[1534] = "M5",[1535] = "M6",[1536] = "N1",[1537] = "N2",[1538] = "N3",[1539] = "N4",[1540] = "N5",[1541] = "N6",[1542] = "O1",[1543] = "O2",[1544] = "O3",[1545] = "O4",[1546] = "O5",[1547] = "O6",[1548] = "P1",[1549] = "P2",[1550] = "P3",[1551] = "P4",[1552] = "P5",[1553] = "P6",[1554] = "Q1",[1555] = "Q2",[1556] = "Q3",[1557] = "Q4",[1558] = "Q5",[1559] = "Q6",[1560] = "R1",[1561] = "R2",[1562] = "R3",[1563] = "R4",[1564] = "R5",[1565] = "R6",[1596] = "S1",[1597] = "S2",[1598] = "S3",[1599] = "S4",[1600] = "S5",[1601] = "S6",[1602] = "T1",[1603] = "T2",[1604] = "T3",[1605] = "T4",[1606] = "T5",[1607] = "T6",[1608] = "U1",[1609] = "U2",[1610] = "U3",[1611] = "U4",[1612] = "U5",[1613] = "U6",[1614] = "V1",[1615] = "V2",[1616] = "V3",[1617] = "V4",[1618] = "V5",[1619] = "V6",[1620] = "W1",[1621] = "W2",[1622] = "W3",[1623] = "W4",[1624] = "W5",[1625] = "W6",[1626] = "X1",[1627] = "X2",[1628] = "X3",[1629] = "X4",[1630] = "X5",[1631] = "X6",[1632] = "Y1",[1633] = "Y2",[1634] = "Y3",[1635] = "Y4",[1636] = "Y5",[1637] = "Y6",[1638] = "Z1",[1639] = "Z2",[1640] = "Z3",[1641] = "Z4",[1642] = "Z5",[1643] = "Z6",[1698] = "a1",[1699] = "a2",[1700] = "a3",[1701] = "a4",[1702] = "a5",[1703] = "a6",[1704] = "b1",[1705] = "b2",[1706] = "b3",[1707] = "b4",[1708] = "b5",[1709] = "b6",[1710] = "c1",[1711] = "c2",[1712] = "c3",[1713] = "c4",[1714] = "c5",[1715] = "c6",[1716] = "d1",[1717] = "d2",[1718] = "d3",[1719] = "d4",[1720] = "d5",[1721] = "d6",[1722] = "e1",[1723] = "e2",[1724] = "e3",[1725] = "e4",[1726] = "e5",[1727] = "e6",[1728] = "f1",[1729] = "f2",[1730] = "f3",[1731] = "f4",[1732] = "f5",[1733] = "f6",[1734] = "g1",[1735] = "g2",[1736] = "g3",[1737] = "g4",[1738] = "g5",[1739] = "g6",[1656] = "h1",[1657] = "h2",[1658] = "h3",[1659] = "h4",[1660] = "h5",[1661] = "h6",[1662] = "i1",[1663] = "i2",[1664] = "i3",[1665] = "i4",[1666] = "i5",[1667] = "i6",[1668] = "j1",[1669] = "j2",[1670] = "j3",[1671] = "j4",[1672] = "j5",[1673] = "j6",[1674] = "k1",[1675] = "k2",[1676] = "k3",[1677] = "k4",[1678] = "k5",[1679] = "k6",[1680] = "l1",[1681] = "l2",[1682] = "l3",[1683] = "l4",[1684] = "l5",[1685] = "l6",[1686] = "m1",[1687] = "m2",[1688] = "m3",[1689] = "m4",[1690] = "m5",[1691] = "m6",[1692] = "n1",[1693] = "n2",[1694] = "n3",[1695] = "n4",[1696] = "n5",[1697] = "n6",[1740] = "o1",[1741] = "o2",[1742] = "o3",[1743] = "o4",[1744] = "o5",[1745] = "o6",[1746] = "p1",[1747] = "p2",[1748] = "p3",[1749] = "p4",[1750] = "p5",[1751] = "p6",}
x900004_Kfs_SkillType = {"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","a","b","c","d","e","f","g","h","i","j","k","l","m","n"}
x900004_KfsItem_YiHunShi = {30700236,30700236,30700249} --忆魂石
--魂冰石
x900004_g_HunBing = {
		20310117,	--魂冰珠（1级）
		20310118,	--魂冰珠（2级）
		20310119,	--魂冰珠（3级）
		20310120,	--魂冰珠（4级）
		20310121,	--魂冰珠（5级）
		}

--绑定魂冰石
x900004_g_HunBing_Bind = {
		20310161,	--魂冰珠（1级）
		20310162,	--魂冰珠（2级）
		20310163,	--魂冰珠（3级）
		20310164,	--魂冰珠（4级）
		20310165,	--魂冰珠（5级）
		}
--武魂外观
x900004_g_KFSVisual = {
	[0] = {4990,4991,4992,4993,4994},
	[1] = {4995,4996,4997,4998,4999},
}
--被动技能索引表
x900004_g_PassiveSkill = {"A","B","C","D","o","p"}
--主动技能表
x900004_g_ActiveSkill = {"E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","a","b","c","d","e","f","g","h","i","j","k","l","m","n"}
x900004_g_nSkillLevelupTab = {
[1500] = {1501,20310117,10000,1},
[1501] = {1502,20310118,10000,2},
[1502] = {1503,20310119,15000,3},
[1503] = {1504,20310120,15000,4},
[1504] = {1505,20310121,20000,5},
[1505] = {-1,-1,-1,6},

[1506] = {1507,20310117,10000,1},
[1507] = {1508,20310118,10000,2},
[1508] = {1509,20310119,15000,3},
[1509] = {1510,20310120,15000,4},
[1510] = {1511,20310121,20000,5},
[1511] = {-1,-1,-1,6},

[1512] = {1513,20310117,10000,1},
[1513] = {1514,20310118,10000,2},
[1514] = {1515,20310119,15000,3},
[1515] = {1516,20310120,15000,4},
[1516] = {1517,20310121,20000,5},
[1517] = {-1,-1,-1,6},

[1518] = {1519,20310117,10000,1},
[1519] = {1520,20310118,10000,2},
[1520] = {1521,20310119,15000,3},
[1521] = {1522,20310120,15000,4},
[1522] = {1523,20310121,20000,5},
[1523] = {-1,-1,-1,6},

[1524] = {1525,20310117,10000,1},
[1525] = {1526,20310118,10000,2},
[1526] = {1527,20310119,15000,3},
[1527] = {1528,20310120,15000,4},
[1528] = {1529,20310121,20000,5},
[1529] = {-1,-1,-1,6},

[1530] = {1531,20310117,10000,1},
[1531] = {1532,20310118,10000,2},
[1532] = {1533,20310119,15000,3},
[1533] = {1534,20310120,15000,4},
[1534] = {1535,20310121,20000,5},
[1535] = {-1,-1,-1,6},

[1536] = {1537,20310117,10000,1},
[1537] = {1538,20310118,10000,2},
[1538] = {1539,20310119,15000,3},
[1539] = {1540,20310120,15000,4},
[1540] = {1541,20310121,20000,5},
[1541] = {-1,-1,-1,6},

[1542] = {1543,20310117,10000,1},
[1543] = {1544,20310118,10000,2},
[1544] = {1545,20310119,15000,3},
[1545] = {1546,20310120,15000,4},
[1546] = {1547,20310121,20000,5},
[1547] = {-1,-1,-1,6},

[1548] = {1549,20310117,10000,1},
[1549] = {1550,20310118,10000,2},
[1550] = {1551,20310119,15000,3},
[1551] = {1552,20310120,15000,4},
[1552] = {1553,20310121,20000,5},
[1553] = {-1,-1,-1,6},

[1554] = {1555,20310117,10000,1},
[1555] = {1556,20310118,10000,2},
[1556] = {1557,20310119,15000,3},
[1557] = {1558,20310120,15000,4},
[1558] = {1559,20310121,20000,5},
[1559] = {-1,-1,-1,6},

[1560] = {1561,20310117,10000,1},
[1561] = {1562,20310118,10000,2},
[1562] = {1563,20310119,15000,3},
[1563] = {1564,20310120,15000,4},
[1564] = {1565,20310121,20000,5},
[1565] = {-1,-1,-1,6},

[1566] = {1567,20310117,10000,1},
[1567] = {1568,20310118,10000,2},
[1568] = {1569,20310119,15000,3},
[1569] = {1570,20310120,15000,4},
[1570] = {1571,20310121,20000,5},
[1571] = {-1,-1,-1,6},

[1572] = {1573,20310117,10000,1},
[1573] = {1574,20310118,10000,2},
[1574] = {1575,20310119,15000,3},
[1575] = {1576,20310120,15000,4},
[1576] = {1577,20310121,20000,5},
[1577] = {-1,-1,-1,6},

[1578] = {1579,20310117,10000,1},
[1579] = {1580,20310118,10000,2},
[1580] = {1581,20310119,15000,3},
[1581] = {1582,20310120,15000,4},
[1582] = {1583,20310121,20000,5},
[1583] = {-1,-1,-1,6},

[1584] = {1585,20310117,10000,1},
[1585] = {1586,20310118,10000,2},
[1586] = {1587,20310119,15000,3},
[1587] = {1588,20310120,15000,4},
[1588] = {1589,20310121,20000,5},
[1589] = {-1,-1,-1,6},

[1590] = {1591,20310117,10000,1},
[1591] = {1592,20310118,10000,2},
[1592] = {1593,20310119,15000,3},
[1593] = {1594,20310120,15000,4},
[1594] = {1595,20310121,20000,5},
[1595] = {-1,-1,-1,6},

[1596] = {1597,20310117,10000,1},
[1597] = {1598,20310118,10000,2},
[1598] = {1599,20310119,15000,3},
[1599] = {1600,20310120,15000,4},
[1600] = {1601,20310121,20000,5},
[1601] = {-1,-1,-1,6},

[1602] = {1603,20310117,10000,1},
[1603] = {1604,20310118,10000,2},
[1604] = {1605,20310119,15000,3},
[1605] = {1606,20310120,15000,4},
[1606] = {1607,20310121,20000,5},
[1607] = {-1,-1,-1,6},

[1608] = {1609,20310117,10000,1},
[1609] = {1610,20310118,10000,2},
[1610] = {1611,20310119,15000,3},
[1611] = {1612,20310120,15000,4},
[1612] = {1613,20310121,20000,5},
[1613] = {-1,-1,-1,6},

[1614] = {1615,20310117,10000,1},
[1615] = {1616,20310118,10000,2},
[1616] = {1617,20310119,15000,3},
[1617] = {1618,20310120,15000,4},
[1618] = {1619,20310121,20000,5},
[1619] = {-1,-1,-1,6},

[1620] = {1621,20310117,10000,1},
[1621] = {1622,20310118,10000,2},
[1622] = {1623,20310119,15000,3},
[1623] = {1624,20310120,15000,4},
[1624] = {1625,20310121,20000,5},
[1625] = {-1,-1,-1,6},

[1626] = {1627,20310117,10000,1},
[1627] = {1628,20310118,10000,2},
[1628] = {1629,20310119,15000,3},
[1629] = {1630,20310120,15000,4},
[1630] = {1631,20310121,20000,5},
[1631] = {-1,-1,-1,6},

[1632] = {1633,20310117,10000,1},
[1633] = {1634,20310118,10000,2},
[1634] = {1635,20310119,15000,3},
[1635] = {1636,20310120,15000,4},
[1636] = {1637,20310121,20000,5},
[1637] = {-1,-1,-1,6},

[1638] = {1639,20310117,10000,1},
[1639] = {1640,20310118,10000,2},
[1640] = {1641,20310119,15000,3},
[1641] = {1642,20310120,15000,4},
[1642] = {1643,20310121,20000,5},
[1643] = {-1,-1,-1,6},

[1644] = {1645,20310117,10000,1},
[1645] = {1646,20310118,10000,2},
[1646] = {1647,20310119,15000,3},
[1647] = {1648,20310120,15000,4},
[1648] = {1649,20310121,20000,5},
[1649] = {-1,-1,-1,6},

[1650] = {1651,20310117,10000,1},
[1651] = {1652,20310118,10000,2},
[1652] = {1653,20310119,15000,3},
[1653] = {1654,20310120,15000,4},
[1654] = {1655,20310121,20000,5},
[1655] = {-1,-1,-1,6},

[1656] = {1657,20310117,10000,1},
[1657] = {1658,20310118,10000,2},
[1658] = {1659,20310119,15000,3},
[1659] = {1660,20310120,15000,4},
[1660] = {1661,20310121,20000,5},
[1661] = {-1,-1,-1,6},

[1662] = {1663,20310117,10000,1},
[1663] = {1664,20310118,10000,2},
[1664] = {1665,20310119,15000,3},
[1665] = {1666,20310120,15000,4},
[1666] = {1667,20310121,20000,5},
[1667] = {-1,-1,-1,6},

[1668] = {1669,20310117,10000,1},
[1669] = {1670,20310118,10000,2},
[1670] = {1671,20310119,15000,3},
[1671] = {1672,20310120,15000,4},
[1672] = {1673,20310121,20000,5},
[1673] = {-1,-1,-1,6},

[1674] = {1675,20310117,10000,1},
[1675] = {1676,20310118,10000,2},
[1676] = {1677,20310119,15000,3},
[1677] = {1678,20310120,15000,4},
[1678] = {1679,20310121,20000,5},
[1679] = {-1,-1,-1,6},

[1680] = {1681,20310117,10000,1},
[1681] = {1682,20310118,10000,2},
[1682] = {1683,20310119,15000,3},
[1683] = {1684,20310120,15000,4},
[1684] = {1685,20310121,20000,5},
[1685] = {-1,-1,-1,6},

[1686] = {1687,20310117,10000,1},
[1687] = {1688,20310118,10000,2},
[1688] = {1689,20310119,15000,3},
[1689] = {1690,20310120,15000,4},
[1690] = {1691,20310121,20000,5},
[1691] = {-1,-1,-1,6},

[1692] = {1693,20310117,10000,1},
[1693] = {1694,20310118,10000,2},
[1694] = {1695,20310119,15000,3},
[1695] = {1696,20310120,15000,4},
[1696] = {1697,20310121,20000,5},
[1697] = {-1,-1,-1,6},

[1698] = {1699,20310117,10000,1},
[1699] = {1700,20310118,10000,2},
[1700] = {1701,20310119,15000,3},
[1701] = {1702,20310120,15000,4},
[1702] = {1703,20310121,20000,5},
[1703] = {-1,-1,-1,6},

[1704] = {1705,20310117,10000,1},
[1705] = {1706,20310118,10000,2},
[1706] = {1707,20310119,15000,3},
[1707] = {1708,20310120,15000,4},
[1708] = {1709,20310121,20000,5},
[1709] = {-1,-1,-1,6},

[1710] = {1711,20310117,10000,1},
[1711] = {1712,20310118,10000,2},
[1712] = {1713,20310119,15000,3},
[1713] = {1714,20310120,15000,4},
[1714] = {1715,20310121,20000,5},
[1715] = {-1,-1,-1,6},

[1716] = {1717,20310117,10000,1},
[1717] = {1718,20310118,10000,2},
[1718] = {1719,20310119,15000,3},
[1719] = {1720,20310120,15000,4},
[1720] = {1721,20310121,20000,5},
[1721] = {-1,-1,-1,6},

[1722] = {1723,20310117,10000,1},
[1723] = {1724,20310118,10000,2},
[1724] = {1725,20310119,15000,3},
[1725] = {1726,20310120,15000,4},
[1726] = {1727,20310121,20000,5},
[1727] = {-1,-1,-1,6},

[1728] = {1729,20310117,10000,1},
[1729] = {1730,20310118,10000,2},
[1730] = {1731,20310119,15000,3},
[1731] = {1732,20310120,15000,4},
[1732] = {1733,20310121,20000,5},
[1733] = {-1,-1,-1,6},

[1734] = {1735,20310117,10000,1},
[1735] = {1736,20310118,10000,2},
[1736] = {1737,20310119,15000,3},
[1737] = {1738,20310120,15000,4},
[1738] = {1739,20310121,20000,5},
[1739] = {-1,-1,-1,6},

[1740] = {1741,20310117,10000,1},
[1741] = {1742,20310118,10000,2},
[1742] = {1743,20310119,15000,3},
[1743] = {1744,20310120,15000,4},
[1744] = {1745,20310121,20000,5},
[1745] = {-1,-1,-1,6},

[1746] = {1747,20310117,10000,1},
[1747] = {1748,20310118,10000,2},
[1748] = {1749,20310119,15000,3},
[1749] = {1750,20310120,15000,4},
[1750] = {1751,20310121,20000,5},
[1751] = {-1,-1,-1,6},

}
--**********************************
--武魂技能安装
--**********************************
function x900004_UseNowKfsSkill(sceneId,selfId)
	local nKfsDefinceID = LuaFnGetItemTableIndexByIndex(sceneId,selfId,110)	
	if nKfsDefinceID ~= 0 then
		local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,110);		
		if nKfsData_main ~= nil then
			local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
			if Pos1 ~= nil and Pos2 ~= nil then
				local nSkillSign = {
					strsub(nSkill,1,2),
					strsub(nSkill,3,4),
					strsub(nSkill,5,6)
				}
				for i = 1,3 do
					if x900004_Kfs_SkillTable[nSkillSign[i]] ~= nil and HaveSkill(sceneId,selfId,x900004_Kfs_SkillTable[nSkillSign[i]]) ~= 1 then
						AddSkill(sceneId,selfId,x900004_Kfs_SkillTable[nSkillSign[i]]);
					end
				end
			end
		end
	end
end
--**********************************
--武魂技能清洗
--**********************************
function x900004_UnNowKfsSkill(sceneId,selfId)
	local nKfsDefinceID = LuaFnGetItemTableIndexByIndex(sceneId,selfId,110)
	if nKfsDefinceID ~= 0 then
		local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,110);
		if nKfsData_main ~= nil then
			local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
			if Pos1 ~= nil and Pos2 ~= nil then
				local nSkillSign = {
					strsub(nSkill,1,2),
					strsub(nSkill,3,4),
					strsub(nSkill,5,6)
				}
				for i = 1,3 do
					if x900004_Kfs_SkillTable[nSkillSign[i]] ~= nil and HaveSkill(sceneId,selfId,x900004_Kfs_SkillTable[nSkillSign[i]]) == 1 then
						DelSkill(sceneId,selfId,x900004_Kfs_SkillTable[nSkillSign[i]]);
					end
				end
			end
		end
	end
	DispatchUICommand(sceneId,selfId, 20200427)
end
--**********************************
--武魂属性结算
--**********************************
function x900004_ComputeKfs(sceneId,selfId)
	local nStr,nSpr,nCon,nInt,nDex = 0,0,0,0,0
	local nIceAttr,nFireAttr,nLightAttr,nPosionAttr = 0,0,0,0
	local nIceDec,nFireDec,nLightDec,nPosionDec = 0,0,0,0
	local nIceSubDec,nFireSubDec,nLightSubDec,nPosionSubDec = 0,0,0,0
	local nIceSubDecL,nFireSubDecL,nLightSubDecL,nPosionSubDecL = 0,0,0,0
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,110);
	local nKfsDefinceID = LuaFnGetItemTableIndexByIndex(sceneId,selfId,110)
	if nKfsDefinceID ~= 0 and nKfsData_main ~= nil then
		local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
		if Pos1 ~= nil and Pos2 ~= nil then
			if x900004_Kfs_AttrType[nKfsDefinceID] ~= nil then
				--基础属性
				local nBaseAttr,nOldBaseAttr = Lua_KfsGetAttrAndOldAttr(1,tonumber(nGrow),x900004_Kfs_AttrType[nKfsDefinceID],tonumber(nLevel))
				nStr = nBaseAttr + nOldBaseAttr
				nBaseAttr,nOldBaseAttr = Lua_KfsGetAttrAndOldAttr(2,tonumber(nGrow),x900004_Kfs_AttrType[nKfsDefinceID],tonumber(nLevel))
				nSpr = nBaseAttr + nOldBaseAttr
				nBaseAttr,nOldBaseAttr = Lua_KfsGetAttrAndOldAttr(3,tonumber(nGrow),x900004_Kfs_AttrType[nKfsDefinceID],tonumber(nLevel))
				nCon = nBaseAttr + nOldBaseAttr
				nBaseAttr,nOldBaseAttr = Lua_KfsGetAttrAndOldAttr(4,tonumber(nGrow),x900004_Kfs_AttrType[nKfsDefinceID],tonumber(nLevel))
				nInt = nBaseAttr + nOldBaseAttr
				nBaseAttr,nOldBaseAttr = Lua_KfsGetAttrAndOldAttr(5,tonumber(nGrow),x900004_Kfs_AttrType[nKfsDefinceID],tonumber(nLevel))
				nDex = nBaseAttr + nOldBaseAttr
				--拓展属性
				local nAttrExType,nAttrExValue,nAttrSign = {},{},{}
				for i = 1,7 do
					nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
					nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
					nAttrSign[i] = nAttrExType[i]..nAttrExValue[i]
					if nAttrExType[i] == "A" then
						nIceAttr = nIceAttr + x900004_nAttrExTable[nAttrSign[i]][4]--nAttrExValue[i]
					end
					if nAttrExType[i] == "B" then
						nIceDec = nIceDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end	
					if nAttrExType[i] == "C" then
						nFireAttr = nFireAttr + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "D" then
						nFireDec = nFireDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "E" then
						nLightAttr = nLightAttr + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "F" then
						nLightDec = nLightDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "G" then
						nPosionAttr = nPosionAttr + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					--减抗
					if nAttrExType[i] == "H" then
						nPosionDec = nPosionDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "I" then
						nIceSubDec = nIceSubDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "J" then
						nFireSubDec = nIceSubDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "K" then
						nLightSubDec = nIceSubDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "L" then
						nPosionSubDec = nIceSubDec + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					--减抗下限
					if nAttrExType[i] == "M" then
						nIceSubDecL = nIceSubDecL + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "N" then
						nFireSubDecL = nFireSubDecL + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "O" then
						nLightSubDecL = nLightSubDecL + x900004_nAttrExTable[nAttrSign[i]][4]
					end
					if nAttrExType[i] == "P" then
						nPosionSubDecL = nPosionSubDecL + x900004_nAttrExTable[nAttrSign[i]][4]
					end
				end
				--
				--武魂外观
				if LuaFnGetItemTableIndexByIndex( sceneId, selfId, 103 ) ~= 0 then
					if x900004_Kfs_AttrType[nKfsDefinceID] == nil then
						LuaFnSetEquipVisual(sceneId,selfId,103,0);
						LuaFnRefreshHumanObject(sceneId,selfId)                        					
					else
						local nNowKfsVisual = LuaFnGetEquipVisual(sceneId,selfId,103)
						local nKfsVisualID = x900004_g_KFSVisual[x900004_Kfs_AttrType[nKfsDefinceID]][tonumber(nMagic) + 1]
						LuaFnSetEquipVisual(sceneId,selfId,103,nKfsVisualID-2000);						
						LuaFnRefreshHumanObject(sceneId,selfId)
					end				    		
				end
				x900004_RefreshKfs(sceneId,selfId);--提醒客户端武魂属性刷新了
			end
			else
						if nMagic == nil then
						   nMagic = 0
						end
						local nKfsVisualID = x900004_g_KFSVisual[x900004_Kfs_AttrType[nKfsDefinceID]][tonumber(nMagic) + 1]
						LuaFnSetEquipVisual(sceneId,selfId,103,nKfsVisualID-2000);						
						LuaFnRefreshHumanObject(sceneId,selfId)
		end
		else
						--武魂外观
				if LuaFnGetItemTableIndexByIndex( sceneId, selfId, 103 ) ~= 0 then
					if x900004_Kfs_AttrType[nKfsDefinceID] == nil then
						LuaFnSetEquipVisual(sceneId,selfId,103,0);
						LuaFnRefreshHumanObject(sceneId,selfId)
                    end						
				end
	end

	--x900004_NotifyTip( sceneId, selfId, "nDex "..nDex )	
	return nStr,nSpr,nCon,nInt,nDex,nIceAttr,nFireAttr,nLightAttr,nPosionAttr,nIceDec,nFireDec,nLightDec,nPosionDec,nIceSubDec,nFireSubDec,nLightSubDec,nPosionSubDec,nIceSubDecL,nFireSubDecL,nLightSubDecL,nPosionSubDecL
end
--**********************************
--武魂技能升级
--**********************************
function x900004_KfsSkillUp(sceneId,selfId,nKfsPos,nMaterialPos,nIndex,nType)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nMaterialPos == nil or nType == nil or nIndex == nil then
		return
	end
	--看看材料是不是上锁了
	if LuaFnIsItemLocked(sceneId, selfId, nMaterialPos) ~= 0 then
		x900004_NotifyTip( sceneId, selfId,  "#{WHYH_161121_68}" )
		return
	end
	if nIndex < 0 or nIndex > 2 then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_72}" )	
		return
	end
	nIndex = nIndex + 1
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_70}" )	
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_71}" )	
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 ~= nil and Pos2 ~= nil then
		local nSkillType,nSkillValue = {},{}
		local nSkillNum = 0;
		local nSkillSign = {}
		for i = 1,3 do
			nSkillType[i] = strsub(nSkill, (i*2) - 1,(i*2) - 1)
			if nSkillType[i] ~= "0" then
				nSkillNum = nSkillNum + 1;
			end
			nSkillValue[i] = tonumber(strsub(nSkill, i*2,i*2))
			nSkillSign[i] = nSkillType[i]..nSkillValue[i]
		end
		if nSkillNum == 0 then
			x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_71}" )	
			return
		end
		if nSkillValue[nIndex] >= 6 then --目前最高开放6级，其实最高应该是8级，但是为了符合策划 (滑.稽)，想开6级以上的缺的自己补吧
			x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_73}" )
			return
		end
		local upSkillID,needItem,nMoney = Lua_GetkfsSkillLevelUp(x900004_Kfs_SkillTable[nSkillSign[nIndex]]);
--		x900004_NotifyTip( sceneId, selfId,"upSkillID "..upSkillID)
		if upSkillID == nil or upSkillID == 0 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_65}")  --请选择需要升级的技能
			return
		end
		-- 武魂的当前技能是否已提升至最高级
		if upSkillID == -1 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_66}")  --该技能已经达到最高等级，不能继续升级！
			return
		end
		local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
		if nMoneySelf < nMoney then
			x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
			return
		end
		if needItem ~= nil and needItem <= 0 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_66}")
			return
		end
		local needItemBind = x900004_GetBindItemIndex(needItem)
		if needItemBind ~= nil and needItemBind <= 0 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_66}")
			return
		end
		local nItemID = LuaFnGetItemTableIndexByIndex(sceneId,selfId,nMaterialPos)
			local needItemName = GetItemName(sceneId,needItem)
			local bRet,strSkillName = LuaFnDelAvailableItem(sceneId,selfId,needItem,1),"#{XYJ_KFS_SKILL_NAME_"..x900004_Kfs_SkillTableEx[upSkillID].."}"
			if bRet ~= 1 then
				local tips = format("升级至%s#H技能需要使用一颗%s#H。您当前放入的魂冰珠不符合升级条目的需要，请重新放置。", strSkillName, needItemName)
				x900004_NotifyTip( sceneId, selfId,tips)
				return
			end
		
		--全部校验都通过了
		nSkillValue[nIndex] = nSkillValue[nIndex] + 1
		local nFinalKfsSkillData = "";
		for i = 1,3 do
			nFinalKfsSkillData = nFinalKfsSkillData..nSkillType[i]..nSkillValue[i]
		end
		local nFinalKfsData = ""
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nFinalKfsSkillData
		nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
		LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
		--数据存储完毕，恭喜玩家了
		LuaFnDelAvailableItem(sceneId,selfId,needItem,1)
		LuaFnCostMoney( sceneId, selfId, nMoney);
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_28}");
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
		--3级以上发小喇叭
		if nSkillValue[nIndex] >= 3 then
			local nGlobalText = format("#P皇天不负有心人，辛苦的付出终有回报。#G#{_INFOUSR%s}#P经过不懈的努力，终于使%s学会了#G%s#P！",
				GetName(sceneId,selfId),
				GetItemName(sceneId,LuaFnGetItemTableIndexByIndex(sceneId,selfId,nKfsPos)),
				"#{XYJ_KFS_SKILL_NAME_"..nSkillType[nIndex]..nSkillValue[nIndex].."}")
			AddGlobalCountNews( sceneId,nGlobalText);
		end
	else
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_71}" )	
		return
	end
end
-- 获得所需的材料对应的绑定材料
function x900004_GetBindItemIndex(needItem)
	if needItem == nil or needItem <= 0 then
		return 0
	end

	-- 所需材料id对应的索引
	local needLevelIndex = 0
	for i=1, getn(x900004_g_HunBing) do
		if x900004_g_HunBing[i] == needItem then
			needLevelIndex = i
			break
		end
	end
	if needLevelIndex == 0 then
		return 0
	end
	
	-- 所需材料对应的绑定材料
	return x900004_g_HunBing_Bind[needLevelIndex]
end
--**********************************
--武魂技能重洗替换
--**********************************
function x900004_SaveWashKfsSkill(sceneId,selfId,nKfsPos)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil then
		return
	end
	local nSavePos = GetMissionData(sceneId,selfId,MD_KFS_REWASH_POS)
	--临时数据重做 2019-11-14 21:57:03 
	local nTempSign = "KFS"..LuaFnObjId2Guid(sceneId,selfId)
	local nSaveSkill = LuaFnGetGlobalDataString(sceneId,selfId,nTempSign)
	local nTempDataLen = GetMissionData(sceneId,selfId,MD_TEMPDATA_LONG)
	if nTempDataLen < 1 then
		x900004_NotifyTip(sceneId,selfId,"本次重洗失败")
		return
	end
	if nSaveSkill == nil or nSaveSkill == "" then
		x900004_NotifyTip(sceneId,selfId,"本次重洗失败")
		return
	end
	nSaveSkill = strsub(nSaveSkill,1,nTempDataLen)
	SetMissionData(sceneId,selfId,MD_TEMPDATA_LONG,0)
	
	if nSaveSkill == nil or nSaveSkill == "" then
		x900004_NotifyTip( sceneId, selfId, "服务端数据异常，本次重洗失败，请再次尝试或联系GM运营团队" )	
		return
	end
	
	if nKfsPos ~= nSavePos then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_48}" )	
		return
	end
	
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_49}" )	
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 ~= nil and Pos2 ~= nil then
		local nFinalKfsData = ""
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nSaveSkill
		nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
		LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
		x900004_NotifyTip( sceneId, selfId,"替换武魂技能成功！");
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
	end
end
--**********************************
--武魂技能重洗请求
--**********************************
function x900004_AskWashKfsSkill(sceneId,selfId,nKfsPos,nCheck)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nCheck == nil then
		return
	end
	if nCheck ~= 0 and nCheck ~= 1 then
		return
	end
	
	if LuaFnGetAvailableItemCount(sceneId,selfId,x900004_KfsItem_YiHunShi[1]) < 10 and nCheck == 1 then --LuaFnMtl_GetCostNum(sceneId, selfId,x900004_KfsItem_YiHunShi[1],x900004_KfsItem_YiHunShi[2],x900004_KfsItem_YiHunShi[3]) < 1 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_KfsItem_YiHunShi[1],10,nCheck);
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_48}" )	
		return
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < 50000 then
		x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_49}" )	
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 ~= nil and Pos2 ~= nil then
		local nSkillType,nSkillValue = {},{}
		local nSkillNum = 0;
		for i = 1,3 do
			nSkillType[i] = strsub(nSkill, (i*2) - 1,(i*2) - 1)
			if nSkillType[i] ~= "0" then
				nSkillNum = nSkillNum + 1;
			end
			nSkillValue[i] = tonumber(strsub(nSkill, i*2,i*2))
		end
		if nSkillNum == 0 then
			x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_49}" )	
			return
		end
		--2019-10-18 20:12:47  武魂技能特征修正
		for i = 1,nSkillNum do
			if i == 1 then
				local nRandIndex = random(1,getn(x900004_g_PassiveSkill))
				nSkillType[i] = x900004_g_PassiveSkill[nRandIndex]
			else
				local nRandIndex = random(1,getn(x900004_g_ActiveSkill))
				nSkillType[i] = x900004_g_ActiveSkill[nRandIndex]
				while nSkillType[i] == nSkillType[i - 1] do
					nRandIndex = random(1,getn(x900004_g_ActiveSkill))
					nSkillType[i] = x900004_g_ActiveSkill[nRandIndex]
				end
			end
		end
		local nFinalKfsSkillData = "";
		for i = 1,3 do
			nFinalKfsSkillData = nFinalKfsSkillData..nSkillType[i]..nSkillValue[i]
		end		
		local nRet = LuaFnDelAvailableItem(sceneId,selfId,x900004_KfsItem_YiHunShi[1],10)--LuaFnMtl_CostMaterial(sceneId,selfId,1,x900004_KfsItem_YiHunShi[1],x900004_KfsItem_YiHunShi[2],x900004_KfsItem_YiHunShi[3])
		if nRet ~= 1 then
			BeginEvent( sceneId )
			AddText( sceneId, "物品扣除失败！请您检查您的背包以准备足够的物品！" )--这里就不补充StringTable_GetData函数了，那么麻烦干嘛。。
			EndEvent( sceneId )
			DispatchMissionTips( sceneId, selfId )
			return
		end
		LuaFnCostMoney( sceneId, selfId, 50000);
		
		--修正临时存储 2019-11-14 21:49:05 
		local nTempSign = "KFS"..LuaFnObjId2Guid(sceneId,selfId)
		SetMissionData(sceneId,selfId,MD_TEMPDATA_LONG,strlen(nFinalKfsSkillData))
		LuaFnSetGlobalDataString(sceneId,selfId,nTempSign,nFinalKfsSkillData)		
		
		SetMissionData(sceneId,selfId,MD_KFS_REWASH_POS,nKfsPos)
		BeginUICommand(sceneId)
			UICommand_AddString( sceneId,nFinalKfsSkillData)
		EndUICommand(sceneId )
		DispatchUICommand(sceneId,selfId, 1000000033)
		x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_55}");
	else
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_49}" )	
		return
	end
end
--**********************************
--武魂技能学习
--**********************************
function x900004_KfsStudySkill(sceneId,selfId,nKfsPos)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil then
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WHXCZL_091026_03}" )	
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId, "#{WH_090729_23}" )	
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 ~= nil and Pos2 ~= nil then
		--nLevel = tonumber(nLevel) --切记
		local nCanHaveSkill = 0;
		if tonumber(nLevel) >= 40 and tonumber(nLevel) < 70 then
			nCanHaveSkill = 1;
		elseif tonumber(nLevel) >= 70 and tonumber(nLevel) < 90 then
			nCanHaveSkill = 2;
		elseif tonumber(nLevel) >= 90 then
			nCanHaveSkill = 3;
		end
		local nSkillType,nSkillValue = {},{}
		local nSkillNum = 0;
		local nSkillStart = 0;
		for i = 1,3 do
			nSkillType[i] = strsub(nSkill, (i*2) - 1,(i*2) - 1)
			if nSkillType[i] ~= "0" then
				nSkillNum = nSkillNum + 1;
			else
				if nSkillStart == 0 then
					nSkillStart = i;
				end
			end
			nSkillValue[i] = tonumber(strsub(nSkill, i*2,i*2))
		end
		if nSkillNum >= nCanHaveSkill then
			x900004_NotifyTip( sceneId, selfId, "#{WH_090729_23}" )	--对不起，你的武魂还没有达到领悟下一个技能的级别
			return
		end
		local needMoney = 0
		if nSkillNum == 0 then
			needMoney = 50000			--第一个技能5金
		elseif 	nSkillNum == 1 then
			needMoney = 100000			--第二个技能10金
		elseif 	nSkillNum == 2 then
			needMoney = 150000			--第三个技能15金
		end
		local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
		if nMoneySelf < needMoney then
			x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
			return
		end
		--2019-10-18 20:12:47  武魂技能特征修正
		if nSkillStart == 1 then
			local nRandIndex = random(1,getn(x900004_g_PassiveSkill))
			nSkillType[nSkillStart] = x900004_g_PassiveSkill[nRandIndex]
		else
			local nRandIndex = random(1,getn(x900004_g_ActiveSkill))
			nSkillType[nSkillStart] = x900004_g_ActiveSkill[nRandIndex]
			while nSkillType[nSkillStart] == nSkillType[nSkillStart - 1] do
				nRandIndex = random(1,getn(x900004_g_ActiveSkill))
				nSkillType[nSkillStart] = x900004_g_ActiveSkill[nRandIndex]
			end
		end
		nSkillValue[nSkillStart] = 1;
		
		local nFinalKfsSkillData = "";
		for i = 1,3 do
			nFinalKfsSkillData = nFinalKfsSkillData..nSkillType[i]..nSkillValue[i]
		end
		local nFinalKfsData = ""
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nFinalKfsSkillData
		nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
		--x900004_NotifyTip( sceneId, selfId,"nFinalKfsData "..nFinalKfsData);
		LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
		LuaFnCostMoney( sceneId, selfId, needMoney);
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_24}");
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
	end
end
function Inspectionitem(sceneId, selfId,n_ItemID,u_ItemID,n_number)
local itemcnom = LuaFnGetAvailableItemCount(sceneId, selfId, n_ItemID)
local itemcnom2 = 0
if itemcnom < n_number then
itemcnom2 = LuaFnGetAvailableItemCount(sceneId, selfId, u_ItemID)
end
if itemcnom + itemcnom2 < n_number then
	BeginEvent(sceneId)
	   AddText(sceneId,"#{_ITEM"..tostring(n_ItemID).."}不足"..n_number.."个");
	EndEvent(sceneId)
	DispatchMissionTips(sceneId,selfId)	
return 0
end
local myret = 1 
local myret2 = 1
if itemcnom >= n_number then
myret = LuaFnDelAvailableItem(sceneId,selfId,n_ItemID,n_number)
else
myret = LuaFnDelAvailableItem(sceneId,selfId,n_ItemID,itemcnom)
end
if itemcnom2 ~= 0 then
myret2 = LuaFnDelAvailableItem(sceneId,selfId,u_ItemID,n_number-itemcnom)
end
if myret ~= 1 and myret2 ~= 1 then
	BeginEvent(sceneId)
		AddText(sceneId,"扣除#{_ITEM"..tostring(n_ItemID).."}失败");
	EndEvent(sceneId)
	DispatchMissionTips(sceneId,selfId)		
  return 0
end
  return 1
end
--**********************************
--重洗武魂成长率
--**********************************
function x900004_KfsReWashGrowEx(sceneId,selfId,nKfsPos,nType,nCheck)
--	测试用，千万记得屏蔽
--	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,"&W65050501500042J4C10000000000000000");
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nType == nil or nCheck == nil then
		return
	end
	if nCheck ~= 0 and nCheck ~= 1 then
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WHXCZL_091026_03}" )	
		return
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < 50000 then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	if Inspectionitem(sceneId, selfId,30700240,30700241,1) ~= 1 then
		return
	end	
	local nFinalKfsData = ""
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	local nNewGrow = 0;
	nNewGrow = random(1,100);		
	if nNewGrow == 100 then
		nNewGrow = random(820,900);
	elseif nNewGrow >= 98 then
		nNewGrow = random(750,820);
	elseif nNewGrow >= 95 then
		nNewGrow = random(700,750);
	elseif nNewGrow >= 80 then
		nNewGrow = random(650,700);
	else
		nNewGrow = random(600,650);
	end
	if nKfsData_main == nil then
		nFinalKfsData = "&W"..nNewGrow.."1001000000101000000000000000000"
	else
		local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
		if Pos1 ~= nil and Pos2 ~= nil then
			if tonumber(nGrow) < nNewGrow then
				nFinalKfsData = "&W"..nNewGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nSkill
			    nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
				x900004_NotifyTip( sceneId, selfId,"#{WHXCZL_091026_07}");
			else
			    x900004_NotifyTip( sceneId, selfId,  "#{WHXCZL_091026_06}" )
			end
			
		else
			x900004_NotifyTip( sceneId, selfId,  "装备数据异常，请联系GM运营团队" )
			return
		end
	end
	
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
	LuaFnCostMoney( sceneId, selfId, 50000);
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂属相更换
--**********************************
function x900004_KfsChangeMagic(sceneId,selfId,nKfsPos,nIndex,nCheck)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nIndex == nil or nCheck == nil then
		return
	end
	if nCheck ~= 0 and nCheck ~= 1 then
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WH_090729_13}" )	
		return
	end
	if nIndex < 1 or nIndex > 4 then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_103}");
		return
	end
	if LuaFnGetAvailableItemCount(sceneId,selfId,x900004_KfsItem_YiXiangDan[1]) < 1 then --LuaFnMtl_GetCostNum(sceneId, selfId,x900004_KfsItem_YiXiangDan[1],x900004_KfsItem_YiXiangDan[2],x900004_KfsItem_YiXiangDan[3]) < 1 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_KfsItem_YiXiangDan[1],1,nCheck);
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_101}");
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 == nil or Pos2 == nil then
		x900004_NotifyTip( sceneId, selfId,  "装备数据异常，请联系GM运营团队" )
		return
	end
	if nIndex == tonumber(nMagic) then
		x900004_NotifyTip( sceneId, selfId, "#{WHYH_161121_104}");
		return
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < 50000 then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	nMagic = nIndex
	local nFinalKfsData = ""
	nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nSkill
	nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
	local nRet = LuaFnDelAvailableItem(sceneId,selfId,x900004_KfsItem_YiXiangDan[1],1)--LuaFnMtl_CostMaterial(sceneId,selfId,1,x900004_KfsItem_YiXiangDan[1],x900004_KfsItem_YiXiangDan[2],x900004_KfsItem_YiXiangDan[3])
	if nRet ~= 1 then
		BeginEvent( sceneId )
		AddText( sceneId, "背包物品不存在或已锁定" )
		EndEvent( sceneId )
		DispatchMissionTips( sceneId, selfId )
		return
	end	
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
	LuaFnCostMoney( sceneId, selfId, 50000);
	x900004_NotifyTip( sceneId, selfId,x900004_Kfs_Magic[nIndex]);
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂拓展属性升级
--**********************************
function x900004_KfsAttrExLevelUp(sceneId,selfId,nKfsPos,nMaterialPos,nIndex,nType)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nMaterialPos == nil or nIndex == nil or nType == nil then
		return
	end
	if nIndex < 1 or nIndex > 10 then
		x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_41}" )
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId,"ERROR:NULL" )
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 == nil or Pos2 == nil then
		x900004_NotifyTip( sceneId, selfId,  "装备数据异常，请联系GM运营团队" )
		return
	end
	local needItem,needMoney = Lua_GetKfsFixAttrEx(nExAttr,100 + nIndex)
	if nType == 0 then
		if nKfsMainPoint ~= 10 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_40}" ) --这里字典不一样，要分开使用
			return
		end
		local nKfsID = LuaFnGetItemTableIndexByIndex( sceneId, selfId, nMaterialPos )
		if nKfsID ~= needItem then
			x900004_NotifyTip( sceneId, selfId,"#{WH_xml_XX(98)}"..GetItemName(sceneId,needItem))
			return
		end
		local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
		if nMoneySelf < needMoney then
			x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
			return
		end
		local nAttrExType,nAttrExValue = {},{}
		local nAttrExNum = 0;
		for i = 1,7 do
			nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
			nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
		end
		if nAttrExValue[nIndex] == 8 then
			x900004_NotifyTip( sceneId, selfId,  "#{WHYH_161121_42}" )
			return
		end
		--最高开放8级
		if nAttrExValue[nIndex] >= tonumber(nExLevel) then
		    x900004_NotifyTip( sceneId, selfId,  "当前合成等级只能强化至"..nAttrExValue[nIndex].."级。" )
			return
		end
			nAttrExValue[nIndex] = nAttrExValue[nIndex] + 1;
--		end
		if LuaFnGetAvailableItemCount(sceneId,selfId,needItem) < 1 then
		   x900004_NotifyTip( sceneId, selfId,"#{WH_xml_XX(98)}"..GetItemName(sceneId,needItem))
		   return
		end
		local nFinalKfsAttrData = "";
		for i = 1,7 do
			nFinalKfsAttrData = nFinalKfsAttrData..nAttrExType[i]..nAttrExValue[i]
		end
		local nFinalKfsData = ""
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nFinalKfsAttrData..nSkill
		nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
		
		LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
		LuaFnCostMoney( sceneId, selfId, needMoney);
		-- LuaFnEraseItem(sceneId,selfId,nMaterialPos);--既然能重叠物品，就不适用这种删除道具的函数
		LuaFnDelAvailableItem(sceneId,selfId,needItem,1)
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_32}");
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
		--4级以上小喇叭
		if nAttrExValue[nIndex] > 4 then
			local nGlobalText = format("#H武惊日月，魂慑乾坤！#G#{_INFOUSR%s}#H在#G大理#{_INFOAIM140,195,2,无崖子}#R无崖子#H处通过武魂技能#G提升#H之法，终于使%s学会了#G%s#H！",
				GetName(sceneId,selfId),
				GetItemName(sceneId,LuaFnGetItemTableIndexByIndex(sceneId,selfId,nKfsPos)),
				Lua_GetKfsFixAttrEx(nAttrExType[nIndex]..nAttrExValue[nIndex]))
			AddGlobalCountNews( sceneId,nGlobalText);
		end
	elseif nType == 1 then
		--快捷提升
		if nKfsMainPoint ~= 10 then
			x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_33}" ) --这里字典不一样，要分开使用
			return
		end
		x900004_NotifyTip( sceneId, selfId,"快捷提升暂不开放" )
		return
	end
end
--**********************************
--增加武魂拓展属性栏
--**********************************
function x900004_AddKfsSlot(sceneId,selfId,nKfspos,nMaterialPos,nCheck)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	local iscommok = 0
	for i = 0,1 do
	  if LuaFnGetAvailableItemCount(sceneId,selfId,20310158+i,1) < 1 then
	     iscommok = iscommok + 1
	  end
	end
	if iscommok == 2 then
	   x900004_NotifyTip( sceneId, selfId,"需要麟木箭或破天箭")
	   return
	end
	if nKfspos == nil or nMaterialPos == nil or nCheck == nil then
		return
	end
	if nCheck ~= 0 and nCheck ~= 1 then
		return
	end
	if nMaterialPos == -1 and nCheck == 1 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_INDEX_SLOT_ITEM1,1,nCheck)
		return
	end
	local nKfsID = LuaFnGetItemTableIndexByIndex( sceneId, selfId, nMaterialPos )
	if nKfsID == 0 and nCheck == 1 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_INDEX_SLOT_ITEM1,1,nCheck)
		return
	end
	if nKfsID ~=  x900004_INDEX_SLOT_ITEM1 and nKfsID ~= x900004_INDEX_SLOT_ITEM2 then
		x900004_NotifyTip( sceneId, selfId,"#{WHYH_161121_134}") --此处只能放入麟木箭、破天剑
		return
	end
	if LuaFnIsItemLocked(sceneId, selfId, nMaterialPos) ~= 0 then
		x900004_NotifyTip( sceneId, selfId,  "#{WHYH_161121_38}" )
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfspos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_13}" )
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfspos);
	local Pos1,Pos2,comLv,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if tonumber(comLv) ~= nil and tonumber(nExAttrNum) ~= nil and tonumber(nExAttrNum) >= tonumber(nExLevel) then
		if tonumber(nExAttrNum) == 10 then
			x900004_NotifyTip( sceneId, selfId,"#{WH_090817_13}") -- 武魂的扩展属性栏数已经到达最大值10栏。
		else
			x900004_NotifyTip( sceneId, selfId,"#{WH_090729_50}") -- 该武魂不能开辟新的属性栏。提升灵力等级后，可以开辟新的属性栏。
		end
		return
	end
	local needMoney = Lua_GetBagKfsSlotMoney(tonumber(nExAttrNum));
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < needMoney then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	if nKfsData_main == nil then --这种情况应该是不存在的
		x900004_NotifyTip( sceneId, selfId,  "武魂等级必须大于1级才可开辟新的拓展属性栏" )
		return
	end
	local nFinalKfsData = ""
	local EquipXiuFu = "&W6022001000000100000000000000000000"
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 ~= nil and Pos2 ~= nil then
		nExAttrNum = tonumber(nExAttrNum) + 1
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..tostring(nExAttrNum)..nExAttr..nSkill
		nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
	else--有其余字符，但是没武魂字符。
		Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(EquipXiuFu,x900004_KfsDataVale)
		nExAttrNum = tonumber(nExAttrNum) + 1
		nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..tostring(nExAttrNum)..nExAttr..nSkill
		nFinalKfsData = nKfsData_main..nFinalKfsData
	end
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfspos,nFinalKfsData);
	LuaFnCostMoney( sceneId, selfId, needMoney);
	LuaFnEraseItem(sceneId,selfId,nMaterialPos);
	--LuaFnDelAvailableItem(sceneId,selfId,nKfsID,1);
	x900004_NotifyTip( sceneId, selfId,"#{WH_090729_55}");
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂拓展打孔消耗
--**********************************
function Lua_GetBagKfsSlotMoney(nSlotNum)
	local nKfsSlotTab = {
		{1000 ,20310158 ,1000 ,20310159 ,10000},
		{700 ,20310158 ,800 ,20310159 ,20000},
		{350 ,20310158 ,500 ,20310159 ,30000},
		{200 ,20310158 ,300 ,20310159 ,40000},
		{100 ,20310158 ,150 ,20310159 ,50000},
		{40 ,20310158 ,80 ,20310159 ,60000},
		{20 ,20310158 ,40 ,20310159 ,70000},
		{15 ,20310158 ,30 ,20310159 ,80000},
		{10 ,20310158 ,20 ,20310159 ,90000},
		{5 ,20310158 ,10 ,20310159 ,100000},
	}
	local nCostMoney = 0
	if nSlotNum ~= nil and nKfsSlotTab[nSlotNum + 1] ~= nil then
		nCostMoney = nKfsSlotTab[nSlotNum + 1][5]
	end
	return nCostMoney
end
--**********************************
--武魂拓展属性删除
--**********************************
function x900004_KfsAttrExDelete(sceneId,selfId,nKfsPos,nIndex)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nIndex == nil then
		return
	end
	if nIndex < 1 or nIndex > 10 then
		x900004_NotifyTip( sceneId, selfId, "#{WH_090729_67}" )	
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_13}" )
		return
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < 1000 then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_57}") --该武魂没有扩展属性
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 == nil or Pos2 == nil then
		x900004_NotifyTip( sceneId, selfId,  "装备数据异常，请联系GM运营团队" )
		return
	end
	local nAttrExType,nAttrExValue = {},{}
	local nAttrExNum = 0;
	for i = 1,7 do
		nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
		if nAttrExType[i] ~= "0" then
			nAttrExNum = nAttrExNum + 1;
		end
		nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
	end
	if nAttrExNum == 0 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_57}") -- 该武魂没有扩展属性
		return
	end
	nAttrExType[nIndex] = "0";
	nAttrExValue[nIndex] = 0;
	
	local nFinalKfsAttrData = "";
	for i = 1,7 do
		nFinalKfsAttrData = nFinalKfsAttrData..nAttrExType[i]..nAttrExValue[i]
	end
	local nFinalKfsData = ""
	nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nFinalKfsAttrData..nSkill
	nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
	
	LuaFnCostMoney( sceneId, selfId, 1000);
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
	x900004_NotifyTip( sceneId, selfId,"#{WH_090729_58}")
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂拓展属性学习
--**********************************
function x900004_KfsAttrExStudy(sceneId,selfId,nKfsPos,nBookPos)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nBookPos == nil then
		return
	end
	if LuaFnIsItemLocked(sceneId, selfId, nBookPos) ~= 0 then
		x900004_NotifyTip( sceneId, selfId,  "#{WHYH_161121_38}" )
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsPos )
	if nKfsMainPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_13}" )
		return
	end
	local nKfsBookID = LuaFnGetItemTableIndexByIndex( sceneId, selfId, nBookPos )
	if x900004_KfsAttrExBook[nKfsBookID] == nil then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_20}" )
		return
	end
	if LuaFnIsItemAvailable( sceneId, selfId,nBookPos) ~= 1 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_20}")
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsPos);
	if nKfsData_main == nil then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_56}") -- 需要有空余的属性栏，才能学习扩展属性。
		return
	end
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
	if Pos1 == nil or Pos2 == nil then
		x900004_NotifyTip( sceneId, selfId,  "装备数据异常，请联系GM运营团队" )
		return
	end
	local nStartIndex = 0;
	local nAttrExType,nAttrExValue = {},{}
	local nAttrExNum = 0;
	for i = 1,7 do
		nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
		if nAttrExType[i] ~= "0" then
			nAttrExNum = nAttrExNum + 1;
		else
			if nStartIndex == 0 then
				nStartIndex = i --何处为空
			end
		end
		nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
	end
	--nStartIndex = nStartIndex + nAttrExNum
	if nAttrExNum >= tonumber(nExAttrNum) and tonumber(nExAttrNum) >= 0 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_56}") -- 需要有空余的属性栏，才能学习扩展属性。
		return
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < 80000 then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	nAttrExType[nStartIndex] = x900004_KfsAttrExBook[nKfsBookID];
	--是否重复校验
	local nPos_1,nPos_2 = strfind(nExAttr,nAttrExType[nStartIndex])
	if nPos_1 ~= nil or nPos_2 ~= nil then
	 	x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_66}" )
	    return
	end
	nAttrExValue[nStartIndex] = 1;
	local nFinalKfsAttrData = "";
	for i = 1,7 do
		nFinalKfsAttrData = nFinalKfsAttrData..nAttrExType[i]..nAttrExValue[i]
	end
	local nFinalKfsData = ""
	nFinalKfsData = "&W"..nGrow..nExLevel..nLevel..nKfsExp..nMagic..nExAttrNum..nFinalKfsAttrData..nSkill
	nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
	
	LuaFnCostMoney( sceneId, selfId, 80000);
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsPos,nFinalKfsData);
	LuaFnEraseItem(sceneId,selfId,nBookPos)
	x900004_NotifyTip( sceneId, selfId,"#{WH_090729_61}")
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂合成
--**********************************
function x900004_KfsCompoud(sceneId,selfId,nKfsMain,nKfsCom)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsMain == nil or nKfsCom == nil then
		return
	end
	if LuaFnIsItemLocked(sceneId, selfId, nKfsCom) ~= 0 then
		x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_15}" )
		return
	end
	local nKfsMainPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsMain )
	local nKfsComPoint = LuaFnGetBagEquipType( sceneId, selfId, nKfsCom )
	if nKfsMainPoint ~= 10 or nKfsComPoint ~= 10 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_13}" )
		return
	end
	local gem_count = GetGemEmbededCount(sceneId,selfId,nKfsCom)
	if gem_count > 0 then
		x900004_NotifyTip( sceneId, selfId,"#{WH_20090904_01}")	--WH_20090904_01 镶嵌有宝石的武魂不能作为合成材料！
		return
	end
	local _,nKfsData_main = LuaFnGetItemCreator(sceneId,selfId,nKfsMain);
	local _,nKfsData_sub = LuaFnGetItemCreator(sceneId,selfId,nKfsCom);
	if nKfsData_sub ~= nil and strfind(nKfsData_sub,"&DW") ~= nil then
		x900004_NotifyTip( sceneId, selfId,"#{ZBDW_091105_17}")	--有雕纹的武魂不能作为材料武魂
		return
	end
	local _,main_lv = x900004_LuaGetKfsAttrData(sceneId,selfId,nKfsData_main)
	local _,sub_lv = x900004_LuaGetKfsAttrData(sceneId,selfId,nKfsData_sub)
	if  main_lv ~= nil and sub_lv ~= nil and main_lv ~= sub_lv then 
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_17}")  --参与合成的武魂灵力等级需要等于要提升灵力等级的武魂
		return
	end
	if main_lv == nil or main_lv >= 8 then
		x900004_NotifyTip( sceneId, selfId,"8级以上的武魂的合成暂未开放。")  --5级以上合成暂不开放。
		return
	end
	local needMoney = 0
	if main_lv ~= nil and main_lv > 0 and main_lv < 10 then
		needMoney = x900004_m_Money_COMPOUND[main_lv]
	end
	local nMoneySelf = GetMoneyJZ(sceneId,selfId) + GetMoney(sceneId,selfId)
	if nMoneySelf < needMoney then
        x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_18}" )
        return
	end
	main_lv = main_lv + 1
	local nFinalKfsData = ""
	if nKfsData_main == nil then
		nFinalKfsData = "&W6022001000000100000000000000000000"
	else
		local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData_main,x900004_KfsDataVale)
		--x900004_KfsDataVale = "&W(%w%w%w)(%w)(%w%w%w)(%w%w%w%w%w)(%w)(%w)("..strrep("%w",14)..")".."("..strrep("%w",6)..")"
		--属相部分
		if Pos1 ~= nil and Pos2 ~= nil then--有字符，和武魂字符存在
			if main_lv == 5 then
				local rand = random(1,4)
				nMagic = rand
				x900004_NotifyTip( sceneId, selfId,x900004_Kfs_Magic[nMagic])
			end
			nFinalKfsData = "&W"..nGrow..main_lv..nLevel..nKfsExp..nMagic..nExAttrNum..nExAttr..nSkill
			nFinalKfsData = gsub(nKfsData_main,x900004_KfsDataVale,nFinalKfsData)
		else--有字符，但是武魂字符不存在
            nFinalKfsData = nKfsData_main.."&W6022001000000100000000000000000000"
		end
	end
	LuaFnCostMoney( sceneId, selfId, needMoney);
	LuaFnSetEquipItemCreatorEx(sceneId, selfId,nKfsMain,nFinalKfsData);
	--设置绑定状态
	if LuaFnGetItemBindStatus(sceneId,selfId,nKfsCom) == 1 then
	    LuaFnItemBind(sceneId,selfId,nKfsMain)
	end
	LuaFnEraseItem(sceneId,selfId,nKfsCom)
	x900004_NotifyTip( sceneId, selfId,"#{WH_090729_19}")
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
end
--**********************************
--武魂延寿
--**********************************
function x900004_AddKfsLife(sceneId,selfId,nKfsPos,nMaiterialPos,nCheck)
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nKfsPos == nil or nMaiterialPos == nil or nCheck == nil then
		return
	end
	if nCheck ~= 0 and nCheck ~= 1 then
		return
	end
	if nMaiterialPos == -1 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_KfsItem_YanShouDan,1,nCheck)
		return
	end
	local nKfsID = LuaFnGetItemTableIndexByIndex( sceneId, selfId, nMaiterialPos )
	if nKfsID == 0 then
		LuaFnBuyNotEnoughMaterial(sceneId,selfId,x900004_KfsItem_YanShouDan,1,nCheck)
		return
	end
	if nKfsID == x900004_KfsItem_YanShouDan then
		local ret = DoHighRepair( sceneId, selfId, nKfsPos, 0);
--		x900004_NotifyTip( sceneId, selfId, "ret "..ret )	
		if ret == -1 then
			x900004_NotifyTip(sceneId,selfId,"该武魂无法再次延寿。")
		elseif ret == -2 then
			x900004_NotifyTip(sceneId,selfId,"#R你的银两不能支付修理延寿。")
		elseif ret == -4 then
			x900004_NotifyTip(sceneId,selfId,"延寿失败")
		elseif ret == -5 then
			x900004_NotifyTip(sceneId,selfId,"延寿过程中出现未知错误。")
		elseif ret == -6 then
			x900004_NotifyTip(sceneId,selfId,"武魂没有损害，不用延寿。")
		elseif ret == 0 then
			x900004_NotifyTip(sceneId,selfId,"#{WH_090729_37}")
			LuaFnDelAvailableItem(sceneId, selfId, x900004_KfsItem_YanShouDan, 1)
			LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
		end
	else
		x900004_NotifyTip( sceneId, selfId, "#{WH_090729_36}" )	
		return
	end
end
--**********************************
--增加武魂经验
--**********************************
function x900004_AddKfsExp(sceneId,selfId,nExp)
	local nKfsID = LuaFnGetItemTableIndexByIndex( sceneId, selfId, 110 )
	if nKfsID == nil or nKfsID == 0 then
		x900004_NotifyTip( sceneId, selfId,  "#{WH_090729_08}" )
		return 0
	end
	
	local _,nKfsData = LuaFnGetItemCreator(sceneId,selfId,110);
	
	if nKfsData == nil then
	
		local nLevel,nMoreExp = Lua_KfsGetLevelUpExpToLeve(nExp)
		--AddGlobalCountNews( sceneId,"nLevel "..nLevel.." nMoreExp "..nMoreExp)
		--经验修正
		local nAddExp = Lua_KfsInt2Str(0,nExp)	
		--等级修正
		nLevel = Lua_KfsInt2Str(1,nLevel)
		local nFinalKfsData = "&W6021"..nLevel..nAddExp.."0101000000000000000000"
		LuaFnSetEquipItemCreatorEx(sceneId,selfId,110,nFinalKfsData)
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_10}"..nExp )
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_11}"..tonumber(nLevel).."#{WH_090729_12}")
	else
		local Pos1,Pos2,nGrow,nExLevel,nLevel,nKfsExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nKfsData,x900004_KfsDataVale)
		if tonumber(nLevel) >= 119 then
			x900004_NotifyTip( sceneId, selfId,"#{WH_090729_09}")
			return 0
		end
		local nAddExp = tonumber(nKfsExp) + nExp
		local nNewLevel,nMoreExp = Lua_KfsGetLevelUpExpToLeve(nAddExp)
		--经验修正
		nAddExp = Lua_KfsInt2Str(0,nAddExp)	
		--等级修正
		nNewLevel = Lua_KfsInt2Str(1,nNewLevel)
		local nFinalKfsData = "&W"..nGrow..nExLevel..nNewLevel..nAddExp..nMagic..nExAttrNum..nExAttr..nSkill
		nFinalKfsData = gsub(nKfsData,x900004_KfsDataVale,nFinalKfsData)
		LuaFnSetEquipItemCreatorEx(sceneId,selfId,110,nFinalKfsData)
		x900004_NotifyTip( sceneId, selfId,"#{WH_090729_10}"..tonumber(nExp) )
		if tonumber(nNewLevel) > tonumber(nLevel) then
			x900004_NotifyTip( sceneId, selfId,"#{WH_090729_11}"..tonumber(nNewLevel).."#{WH_090729_12}")
		end
	end
	LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0);
	x900004_RefreshKfs(sceneId,selfId);--提醒客户端武魂属性刷新了
	return 1
end
--**********************************
--经验、等级文本修正
--**********************************
function Lua_KfsInt2Str(nType,nValue)
	if nType == 0 then
		if nValue < 10 then
			nValue = "0000"..nValue
		elseif nValue < 100 and nValue >= 10 then
			nValue = "000"..nValue
		elseif nValue < 1000 and nValue >= 100 then
			nValue = "00"..nValue
		elseif nValue < 10000 and nValue >= 1000 then
			nValue = "0"..nValue
		end
		return nValue
	else
		if nValue < 10 then
			nValue = "00"..nValue
		elseif nValue < 100 and nValue >= 10 then
			nValue = "0"..nValue
		end
		return nValue
	end
end
--**********************************
--获取武魂基础属性
--**********************************
function Lua_KfsGetAttrAndOldAttr(nType,nGrow,nAttrType,nKFS_Level)
	local nBaseAttr,nOldBaseAttr = 0,0
	local nAttrTable = {
		[0] = {2,1,1,1,1},
		[1] = {1,2,1,1,1},
		}
	if nType >= 1 and nType <= 5 and nAttrType ~= nil and nAttrType >= 0 and nAttrType <= 1 then
		nBaseAttr = ceil(nAttrTable[nAttrType][nType] * ((nGrow/100) + 1) * (nKFS_Level/10))
		nOldBaseAttr = ceil(nBaseAttr * ((nGrow/1000) + 1))
	end
	return nBaseAttr,nOldBaseAttr
end
--**********************************
--获取武魂升级所需经验
--**********************************
function Lua_KfsGetLevelUpExpToLeve(nExp)
	local nLevel,nMoreExp = 1,0
	if nExp >= x900004_nExpTable[119] then
		return 119,0
	end
	for i = 1,getn(x900004_nExpTable) do
		if x900004_nExpTable[i] >= nExp then
			nLevel = i - 1;
			nMoreExp = x900004_nExpTable[i] - nExp
			break
		end
	end
	if nLevel < 1 then
		nLevel = 1
	end
	return nLevel,nMoreExp
end
function Lua_KfsGetLevelUpNeedExp(nLevel)
	local nExp = 0
	if x900004_nExpTable[nLevel] ~= nil then
		nExp = x900004_nExpTable[nLevel]
	end
	return nExp
end
--**********************************
--获取武魂属性
--**********************************
function x900004_LuaGetKfsAttrData(sceneId,selfId,nEquipData)
	--&W 000 0 000 00000 0 00 (00 00 00 00 00 00 00 00 00 00)(00 00 00)
	--成长率
	--合成等级
	--武魂等级
	--经验值
	--武魂属相 0-4
	--拓展属性栏数量
	--拓展属性
	--武魂技能
	local Pos1,Pos2,nGrow,nExLevel,nLevel,nExp,nMagic,nExAttrNum,nExAttr,nSkill = 0,0,0,0,0,0,0,0,"",""
	if nEquipData == nil then
		nGrow = 600
		nExLevel = 1
		nLevel = 1
		nExp = 0
		nMagic = 0
		nExAttrNum = 1
		nExAttr = ""
		nSkill = ""
	else
		Pos1,Pos2,nGrow,nExLevel,nLevel,nExp,nMagic,nExAttrNum,nExAttr,nSkill = strfind(nEquipData,x900004_KfsDataVale)
		if Pos1 == nil or Pos2 == nil then
			nGrow = 600
			nExLevel = 1
			nLevel = 1
			nExp = 0
			nMagic = 0
			nExAttrNum = 1
			nExAttr = ""
			nSkill = ""
		end
	end
	return tonumber(nGrow),tonumber(nExLevel),tonumber(nLevel),tonumber(nExp),tonumber(nMagic),tonumber(nExAttrNum),nExAttr,nSkill
end
--**********************************
--润魂石合成
--**********************************
function x900004_RunHunShiCompound( sceneId, selfId , Page , nIndex , nSubIndex)
	--x900004_NotifyTip( sceneId, selfId,  "Page:"..Page.." nIndex:"..nIndex.." nSubIndex:"..nSubIndex )
	--1快捷2普通
	--主类型
	--子类型
	if IsPilferLockFlag(sceneId,selfId) <= 0 then
		x900004_NotifyTip( sceneId, selfId, "#{OR_PILFER_LOCK_FLAG}" )	
		return
	end
	if nIndex < 1 or nIndex > 4 then
		x900004_NotifyTip( sceneId, selfId,  "数据非法！请不要非法篡改客户端！" )
		return
	end
	if nSubIndex < 1 or nSubIndex > 6 then
		x900004_NotifyTip( sceneId, selfId,  "数据非法！请不要非法篡改客户端！" )
		return
	end
	if Page == 1 then--快捷系统
	    local NeedItemMsg = {[1] = 20310122,[2] = 20310131,[3] = 20310140,[4] = 20310149}
		local Count = LuaFnGetAvailableItemCount(sceneId, selfId, NeedItemMsg[nIndex])
		local NeedNum = x900004_RunHunShiCompound_Data[Page][nSubIndex].needcount
		if Count < NeedNum then
			x900004_NotifyTip( sceneId, selfId,  "对不起，您现在背包里没有足够的"..GetItemName(sceneId,NeedItemMsg[nIndex]))
		    return
		end
		local nMoneyJZ = GetMoneyJZ(sceneId,selfId)
		local nMoneyJB = GetMoney(sceneId,selfId)
		local nMoneySelf = nMoneyJZ + nMoneyJB
		if nMoneySelf < x900004_RunHunShiCompound_Data[Page][nSubIndex].needmoney then
			x900004_NotifyTip( sceneId, selfId,  "对不起，你身上金钱不足，无法继续进行" )
			return
		end
--		local ret = CallScriptFunction( 990000, "AddXYZ",sceneId,selfId,1,x900004_RunHunShiCompound_Data[Page][nSubIndex].needcount)
--		if ret == 1 then
--			return
--		end
		LuaFnDelAvailableItem(sceneId,selfId,NeedItemMsg[nIndex],NeedNum)
		TryRecieveItem( sceneId, selfId, x900004_RunHunShiCompound_Item[nIndex][nSubIndex + 1], 1 )
		LuaFnCostMoney( sceneId, selfId, x900004_RunHunShiCompound_Data[Page][nSubIndex].needmoney );
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0)
        x900004_NotifyTip( sceneId, selfId, "你合成了一个#{_ITEM"..x900004_RunHunShiCompound_Item[nIndex][nSubIndex + 1].."}！" )
	end
	if Page == 2 then--普通系统
		local Count = LuaFnGetAvailableItemCount(sceneId, selfId, x900004_RunHunShiCompound_Item[nIndex][nSubIndex])
		local NeedNum = x900004_RunHunShiCompound_Data[Page][nSubIndex].needcount
		--x900004_NotifyTip( sceneId, selfId, NeedNum )
		if Count < NeedNum then
			x900004_NotifyTip( sceneId, selfId,  "对不起，您现在背包里没有足够的#{_ITEM"..x900004_RunHunShiCompound_Item[nIndex][nSubIndex].."}！")
		    return
		end
		local nMoneyJZ = GetMoneyJZ(sceneId,selfId)
		local nMoneyJB = GetMoney(sceneId,selfId)
		local nMoneySelf = nMoneyJZ + nMoneyJB
		if nMoneySelf < x900004_RunHunShiCompound_Data[Page][nSubIndex].needmoney then
			x900004_NotifyTip( sceneId, selfId,  "对不起，你身上金钱不足，无法继续进行" )
			return
		end
		
		-- local ret = XiaoYaoZhi(sceneId,selfId,1,x900004_RunHunShiCompound_Data[Page][nSubIndex].needcount)
		-- if ret == 1 then
			-- return
		-- end
		LuaFnDelAvailableItem(sceneId,selfId,x900004_RunHunShiCompound_Item[nIndex][nSubIndex],NeedNum)
		TryRecieveItem( sceneId, selfId, x900004_RunHunShiCompound_Item[nIndex][nSubIndex + 1], 1 )
		LuaFnCostMoney( sceneId, selfId, x900004_RunHunShiCompound_Data[Page][nSubIndex].needmoney );
		LuaFnSendSpecificImpactToUnit(sceneId, selfId, selfId, selfId, 49, 0)
        x900004_NotifyTip( sceneId, selfId, "你合成了一个#{_ITEM"..x900004_RunHunShiCompound_Item[nIndex][nSubIndex + 1].."}！" )
	end
end
--**********************************
--打开武魂
--**********************************
function x900004_OpenWuHun(sceneId,selfId)
	local _, Creator = LuaFnGetItemCreator(sceneId, selfId,110);
	if Creator == nil then
		Creator = "0"
	end
	BeginUICommand(sceneId)
	    UICommand_AddString(sceneId,Creator)
    EndUICommand(sceneId)
    DispatchUICommand(sceneId,selfId,20181030)
end
--**********************************
--刷新武魂
--**********************************
function x900004_RefreshKfs(sceneId,selfId)
	local _, Creator = LuaFnGetItemCreator(sceneId, selfId,110);
	if Creator == nil then
		Creator = "0"
	end
	BeginUICommand(sceneId)
	    UICommand_AddString(sceneId,Creator)
    EndUICommand(sceneId)
    DispatchUICommand(sceneId,selfId,1000000030)
end
--**********************************
--武魂拓展属性
--**********************************
function Lua_GetKfsFixAttrEx(nExAttr,nIndex)
	if x900004_nAttrExTable[nExAttr] ~= nil then
		return x900004_nAttrExTable[nExAttr][1]
	end
	local iText , iValue = "",0
	local nAttrExType,nAttrExValue = {},{}
	local nAttrExNum = 0;
	if nIndex >= 1 and nIndex <= 7 and nExAttr ~= nil then
		--nExAttr nIndex
		for i = 1,7 do
			nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
			if nAttrExType[i] ~= "0" then
				nAttrExNum = nAttrExNum + 1;
			end
			nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
		end
		local nAttrExIndex = nAttrExType[nIndex]..tostring(nAttrExValue[nIndex])
		if x900004_nAttrExTable[nAttrExIndex] ~= nil then
			iText = x900004_nAttrExTable[nAttrExIndex][1]
			iValue = x900004_nAttrExTable[nAttrExIndex][4]
		end
	end
	if nIndex == 0 and nExAttr ~= nil then
		for i = 1,7 do
			nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
			if nAttrExType[i] ~= "0" then
				nAttrExNum = nAttrExNum + 1;
			end
		end
		return nAttrExNum
	end
	if nIndex >= 100 and nExAttr ~= nil then
		for i = 1,7 do
			nAttrExType[i] = strsub(nExAttr, (i*2) - 1,(i*2) - 1)
			nAttrExValue[i] = tonumber(strsub(nExAttr, i*2,i*2))
		end
		nIndex = nIndex - 100
		local nFinalIndex = nAttrExType[nIndex]..nAttrExValue[nIndex]
		if x900004_nAttrExTable[nFinalIndex] ~= nil then
			return x900004_nAttrExTable[nFinalIndex][2],x900004_nAttrExTable[nFinalIndex][3]
		else
			return 0,-1
		end
	end
	return iText,iValue,nAttrExNum
end
function Lua_GetkfsSkillLevelUp(nSkillID)
	local nNewSkillID,nItemID,nMoney,nLevel = 0,0,0,0
	if x900004_g_nSkillLevelupTab[nSkillID] ~= nil then
		nNewSkillID = x900004_g_nSkillLevelupTab[nSkillID][1]
		nItemID = x900004_g_nSkillLevelupTab[nSkillID][2]
		nMoney = x900004_g_nSkillLevelupTab[nSkillID][3]
		nLevel = x900004_g_nSkillLevelupTab[nSkillID][4]
	end  
   return nNewSkillID,nItemID,nMoney,nLevel
end
--**********************************
--醒目提示
--**********************************
function x900004_NotifyTip( sceneId, selfId, Msg )
	BeginEvent( sceneId )
		AddText( sceneId, Msg )
	EndEvent( sceneId )
	DispatchMissionTips( sceneId, selfId )
end